[
    {
        "id": "mi854no",
        "body": "[deleted]",
        "score": -1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi85huo",
        "body": "AFAIK, if you have an American Visa/Passport you're considered a tourist and can visit for up to 90 days. If you attempt to reinstate your Korean Citizenship or failed to renounce it and want to *live* in Korea, then you'll have to serve in the ROK Military based on your age. You'll be fine just visiting.",
        "score": -6,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8e7x7",
        "body": "Just to add, this page (Korean Embassy in Washington DC) has info on military service for Korean Nationals residing overseas.\n\n[2024 Military Service Information for Korean Nationals Residing Overseas Liable for Military Service 상세보기|Military ServiceEmbassy of the Republic of Korea in the USA](https://overseas.mofa.go.kr/us-en/brd/m_4505/view.do?seq=2&page=1)",
        "score": 3,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8ekpm",
        "body": "Are you looking to register/claim your Korean Citizenship?  And are you above or below 22 years of age?",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8gvoc",
        "body": "This! Also check in with your nearest Korean Conulate or embassy. Ultimately comes down to if are registered to the National registry. You can have your parents inquire too I think.",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi87sgf",
        "body": "Korea does allow dual citizenship under a few special circumstances (with \"being born to Korean parent(s) overseas\" being one).",
        "score": 3,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi85oub",
        "body": "I have an American citizenship since I was born here but the worry is what if I have a Korean citizenship that I don’t know about because my parents had me when they were still not us citizens. I would only be visiting for a week or two",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8doqw",
        "body": "This is wrong because it depends if OPs parents registered him as a Korean citizen when he was born hence will have dual citizenship. It specifically says this in the official korean/US embassy website that problems due arise when this happens especially when his dual citizenship wasn't denounced before 18 years old",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8fng7",
        "body": "I know that I already missed the deadline to claim mine, unfortunately. I'm over 22, so I can only 국적이탈신고 at this point. The problem with that is that it can take more than a year to process, and I already had plans for exchange this September. I had assumed I could get a visa, but now I'm waiting on paperwork to process so that I'll be able to apply for one. It threw a wrench into my plans for sure.\n\nI really wish I had known sooner so that I could claim my dual citizenship.",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8h78a",
        "body": "Sorry to hear.  A while back, there was some discussion about what happens at age 23; is the Korean Citizenship automatically lost or does Korea need to serve the individual with a choice of nationality form and then if no action is taken the Korean Citizenship is lost.  I'm not 100% sure which it is, although my assumption has been they won't let someone keep dual if they miss the deadline (they may let them keep Korean Citizenship if they renounce the foreign citizenship).\n\nAnyways, once your loss of nationality is recorded, you can also apply for a F-4 visa.  This will give you residency/work rights in Korea (if you ever want them).",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8hz7e",
        "body": "I've found through multiple calls to the consulate that the Korean citizenship is never automatically lost. Even though my birth had not been registered, and I had passed the age-22 deadline, they said I will not be able to get a visa as I am still a citizen. However, since the deadline has passed, I cannot keep dual and must renounce one (Korean or Canadian, in my case). I need a visa to study in Korea, so I currently going through the process of registering my birth, renouncing my Korean citizenship, then applying for the visa. \n\nAlso, like you mentioned, I'm looking into getting the F-4 visa as that allows me a lot more flexibility.\n\nAre you yourself a dual citizen? You seem very knowledgeable on this topic. I've only recently had to do a lot of research (which included many phone calls to the consulate and internet searches).",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8jzpf",
        "body": "Interesting, thanks for the clarification.  I had a feeling this was the case, as especially with the males it allows them to prosecute claims if the person comes back to Korea (from Korea's standpoint, it is much better that the person is still a Korean Citizen vs. them calling their embassy claiming they are being harassed).\n\nI also know where you are stuck.  To obtain a longer-term visa, they will want to see the birth certificate and understand whether anyone is in fact a Korean National (who are the parents and what was their nationality/status at the time of birth).\n\nAnyways, good news is that the F-4 should be easy to obtain once you finish the current process.  Although that doesn't help if you are trying to get a visa for the fall(?).\n\nBest of luck, hope it is sorted out soon.",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8molg",
        "body": "I've deferred my original study term, so I'll hopefully have everything ready before then. And thanks, fingers crossed.",
        "score": 1,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8sl2e",
        "body": "You can always contact them to know for sure, but I’ve never been turned away for my tattoos. It’s not like Japan.",
        "score": 2,
        "post_id": "1jdaf2h"
    },
    {
        "id": "mi90xye",
        "body": "When you searched this sub for tattoos and saunas or jjimjilbang what came up??",
        "score": 1,
        "post_id": "1jdaf2h"
    },
    {
        "id": "mi8vo2f",
        "body": "Thanks! Have you been there?",
        "score": 1,
        "post_id": "1jdaf2h"
    },
    {
        "id": "mi6r950",
        "body": "Protests here are controlled. They just stay in their lane and police handle them efficiently 99% of the time. There was only that one time where it turned nasty and it happened in the wee hours. Anyway, I was in Gwanghwamun yesterday and there were no protests anywhere near Koreana. In fact, it was eerily quiet.",
        "score": 25,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi6or5m",
        "body": "Meh should be fine. There are protests every weekend if not minor ones every day. The city deals with it pretty efficiently.",
        "score": 15,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi6t0pt",
        "body": "I was staying in front of Anguk station few weeks ago and every evening on Fridays, Saturdays and Sundays was a protest directly in front of my Airbnb. It was a little noisy if I was taking a nap before dinner (like I did one evening) and there were 15 meter tall barricades so you couldn’t see the street like at all, but you were still able to use the crosswalks. \n\nTLDR; it was definitely a noticeable event happening, but it didn’t prevent us or slow us down from doing any of our activities.",
        "score": 5,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi6ydb6",
        "body": "I was there during the protests and martial law was declared. Never had disruptions to public transport or access to anything. The people protesting were there to make their point but at no point did we feel unsafe. The people protesting were so courteous to everyone passing by. I wouldn't have any worries about staying at the Koreana or any other hotel near a landmark",
        "score": 6,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi766he",
        "body": "There’s something going on every day but mostly l more people turn up at rallies over the weekends. I just got back from Seoul. It’s non violent. There was even a split of groups demonstrating between those for impeachment and those against for the president. I happened to be with a tour group at the time when I saw it. You’ll be fine.",
        "score": 3,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi79q09",
        "body": "It’s safe, don’t worry.",
        "score": 4,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7h6mj",
        "body": "The two camps are always either at Gwanghwamun or Anguk/Jonggak area. They won't impede your activities but there will be some noise during the day.",
        "score": 2,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi6vxsg",
        "body": "Protests in Korea have been strictly non-violent cultural protests since the 2000s. The possibility of protests turning violent is slim because both the protest organizers, civic groups, and the police make every effort to prevent protests from turning violent.",
        "score": 3,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi83udn",
        "body": "I just walked by the protest today. I did not feel unsafe at all. Pretty organized and lots of police to manage it all.",
        "score": 1,
        "post_id": "1jd0kr2"
    }
]