[
    {
        "id": "mi8c0kc",
        "body": "Not an issue at all",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8hkk3",
        "body": "Just got back from seoul- stayed at the four seasons. Stayed 3 weeknights (not weekend) there was a bit of noise but could barely hear it in our room, it didn’t bother us at all",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8iz9h",
        "body": "I wouldn't worry. I stayed at the Four Seasons last June (just around the corner from Koreana) and there were major protests on 1 of the days. Traffic was a bit jammed, definitely noisy but overall the protest was very controlled and mainly during the day (when we were not in our hotel rooms). They rope off the protest area clearly so there will unlikely be a situation where you can't leave your hotel due to the protests. The worst situation is once you leave your hotel you will need to immediately turn left or right because the new roped off section restricts your area outside your hotel a little. \n\nI don't think this should be a major concern.",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8ryww",
        "body": "Just now leaving Korea after 7days of vacation. \n\nExperienced protests twice in 5 days in Seoul, mostly near Gwanghwamun. They are setup around the palace during the day but they are off to the side of the road and do not cause any inconvenience aside from their tents and banners maybe disrupting tourists taking photos of the King statue from Gwanghwamun gate. If you are going in the palace through the gate, you will see them behind you but they won't show in your photos. They have speakers playing some protest stuff but it isn't loud. Some people stand around Gwanghwamun square with speakers but I'm not sure if they are protesting or marketing some religion or selling stuff. Locals act indifferent to all of it, focusing more on their phones when not walking, so I assume it's all part of their daily routine. Police are scattered around the protest area but it's not so concentrated that you will feel uncomfortable. I've experienced more chaos in Myeongdong-gil, the tourist shops street. \n\nThis was our experience from noon to late afternoon on our schedule for Gwanghwamun. From what I've heard, more people showed up later that night but by 9pm everything was quiet. I saw your hotel from the streets, its not going to be affected. \n\nThe next day we were on the opposite side of the city the whole day with no clue what was going on at the square. After a long day, we decided to ride the bus back to our hotel only to find traffic on the main road leading to gwanghwamun. We just caught the start of the protest march around 7pm. All routes that went along the path of the protest had heavy traffic but the flow was controlled by the authorities. Luckily the bus route we took turned off the main road quickly. Had we taken the subway, we wouldn't have known there was a march. It was more like a parade really with how it was very well organized. It happened around the time of people going home from work so there were more people in the local street food stands. \n\nThis happened on March, I'm pretty sure any \"protest\" in April will mostly be the same. All in all, don't let the protests desuade you from your plans.",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi6vtz8",
        "body": "I was down there on Saturday and it was incredibly loud.  I was talking to my gf about how pissed I would be if I had shelled out for a room at the Four Seasons.  Koreana is right there, too.  The guy shouting on the megaphone was so loud that even after we had gone hiking along the Bugak Skyway on the other side of the mountain we could still here him.  There is some kind of demonstration going on there most weekends.  It's not a pain getting in and out but the noise is pretty annoying.",
        "score": -8,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7kh1i",
        "body": "Safe wasn't my concern as much as whether I'd be able to even make it to the hotel. Or leave it.",
        "score": 0,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8x7en",
        "body": "I stayed at the four seasons during the protests. Not an issue whatsoever.",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi74t1k",
        "body": "Sir, this is a protest. You know because the citizens of the country are pissed at the cluster fuck that is their govt. Yall should try it some time.",
        "score": 18,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7k5is",
        "body": "Let's be clear here: I'm looking for all opinions, and this one is noted just as much as anyone else's. I appreciate the thoughts, experiences and perceptions of what's happening in Seoul and how it may affect a tourist's visit-- up or down, good or bad.",
        "score": 3,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7a70a",
        "body": "I don't care about getting down voted but I am curious as to how simply describing Gwanghamun on a Saturday is considered innaccurate by some?  If I had paid big money for a hotel room should I be mollified by the fact that people are demonstrating next door as opposed to just being loud for no reason in particular?",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8xd7b",
        "body": "I stayed at the four seasons in a suite and the noise was not an issue.",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7e14q",
        "body": "Because people are ridiculous. OP is asking for a suggestion about their hotel booking location considering protests, and you are giving your experience having witnessed a protest near the location they are requesting information on. I guess people think that you’re implying that people shouldn’t be protesting or are protesting too loudly? But that’s not the way I took it nor the way I think you intended it.",
        "score": 8,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7h4ej",
        "body": "Ack. I paid big money for a room at the Four Seasons. We arrive next Sunday. Was it so loud? Should I look for another hotel?",
        "score": 1,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7fs6v",
        "body": "Thanks.  That's what I was doing.  Giving them some info as it pertained to that location.  I like that general area and probably go once a month, weather permitting.  There is always something loud going on.",
        "score": 7,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7hf4p",
        "body": "Request a room facing away from Gwanghamun, but if you arrive Sunday and are staying a few nights there shouldn't be anything unusual going on during the work week.  It's a nice and interesting part of Seoul.",
        "score": 3,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi7krow",
        "body": "Sending you a DM, please let me know what the plans are and how it goes, since we're booked in the same vicinity.",
        "score": 0,
        "post_id": "1jd0kr2"
    },
    {
        "id": "mi8noq9",
        "body": "Korean temple food is close to vegan food.  \nThere are also bean restaurants that specialize in bean dishes with beans and tofu as the main ingredients.\n\nOther foods that come to mind are...  \nVegetable kimbap, bibimbap (with egg), wild vegetable bibimbap, pajeon (with squid).  \nSome traditional Korean porridges(죽), such as red bean porridge and pumpkin porridge.",
        "score": 5,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8mpxb",
        "body": "Bibimbop is traditionally served vegan. Get the stone bowl kind.  Ssambop can be vegan, just tell the server you want vegan.",
        "score": 3,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8zc6s",
        "body": "Sanchon in Insadong! It's a whole experience, and the owner is friendly as well  [Sanchon](https://maps.app.goo.gl/wpbeBs52xfPwfPhaA)",
        "score": 1,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8pk3w",
        "body": "Be careful with Japchae - a lot of times it will have small amounts of Bulgogi in it. \n\nDon't eat kimchi as it will often use either oysters or shrimp for seasoning. \n\nThere are restaurants that serve like 50 or more banchan dishes - many of those dishes will be vegan based.\n\nSome street food: hoeduk (there is a vendor on the north side of Namdaemun, that makes a Japchae hoeduk, that is phenomenal), mung bean cakes, the small kimbop (I forgot the Korean name, but they are called drug kimbop, but they are the size of a finger).\n\nOther dishes: Jjolmyun (there is a street ally in Namdaemun where a bunch of ajumas). Bibim namemyun. Both of these dishes may be served with a hard boiled egg, but you can pretty easily remove it?",
        "score": 1,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8q6tw",
        "body": "Thanks!! Do i have to go to a temple to eat or it’s a cuisine I can find in certain restaurants?",
        "score": 1,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8pp1g",
        "body": "Thanks for the recommendations! I was craving bibimbop but i always see eggs on them and wasn’t sure if they used lard or meat. 완전 채식주의자 Is that the right translation for vegan?",
        "score": 1,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8thk7",
        "body": "Thanks for the recommendations! First time hearing about the savory hottok i always thought they came with sweet red beans only but that’s sounds delicious 🤤",
        "score": 1,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi8qlwj",
        "body": "If you googling '사찰음식 식당', there are a lot of them. I haven't been to any of them, so I can't recommend any specific ones.",
        "score": 2,
        "post_id": "1jd9th6"
    },
    {
        "id": "mi89fwn",
        "body": "\"I am told that sometimes the only way to connect with the best clinics is thru the concierge services\"\n\nWho told you that?",
        "score": 2,
        "post_id": "1jd6cnl"
    }
]