[
    {
        "id": "mi8de36",
        "body": ">Honestly I tried to stack as much things as I could\n\nAnd it shows. It's not a good idea but you'll get stressed by the timing and you won't enjoy the visits.",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7tlns",
        "body": "I thought you'd be staying in Kyoto till late into the evening before heading back to Osaka to rest, but if that's you doing everything during the daytime, then that's even worse. For your info, you can travel to Nara from Kyoto as well.\n\nAlso not sure how you'd achieve the 20-30mins traveling time between each spot unless you're taking a cab. For example, traveling time from Kinkakuji to Arashiyama area can take you around 2hrs.\n\n[https://www.japanistry.com/onsen-vs-sento/](https://www.japanistry.com/onsen-vs-sento/)\n\nI don't really do sento myself, so I can't really give any recommendation. Some hotels have public baths, and those are generally good enough for me.",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7ttfn",
        "body": "If you just like the movies and expect a movie experience then no. If you  like any of Harry Potter, Mario, Jaws, Minions,  Jurrasic Park and want to experience them in an interactive immersive level then I'd say yes. Check out some videos and see if you think its cool enough to visit.\n\nI like theme parks so I would. So it comes down to you.",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi8dj6l",
        "body": "Do you suggest I eliminate some of them?",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7txf0",
        "body": "Thank you. I will take a look at it!",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi8dxqj",
        "body": "Yes. A least 1/3rd, if not half.\n\nKeep only the \"absolute must see\" (based on -your- preferences). If you have some free time, use it to visit the rest of your list.",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi8e6xo",
        "body": "Thank you, I will try to lighten it up.",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi8gdcc",
        "body": "Good. \n\nRegroup them in \"close places\" from which you can walk (it's -almost- the case, but not always, in your proposal... For instance walking from Kabukiza to Yasukuni would be doable but long, and Day 13 is all over the place).",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi3vuuf",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5c8ng",
        "body": "I like your itinerary, although each day is too  packed and ambitious for me. I would take my time and enjoy the experience instead of rushing to the next item on the list. Thumbs up to Kabukiza theater - you are the first to include a show there. You will love it as I did. I have not been to Hakone or stayed in Osaka. \n\nA vegetarian friend went to Japan last year. She printed out her diet restriction in Japanese and showed it to the eatery.",
        "score": 2,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi4za60",
        "body": "I would recommend a spa break every 4-5 day.  \nbut since the first leg you will end up in hakone anyway,  \nSo try out spa in osaka/kobe area\n\nOsaka  \n[Spaworld](https://www.spaworld.co.jp/english/)\n\nKobe  \n[Kobe Harborland Onsen Manyo Club](https://www.manyo.co.jp/kobe/eng/)\n\n[Kobe Sauna & Spa](https://www.kobe-sauna.co.jp/)  \n\\---  \nor give bath bomb/bath tablet a try in your room,If you like it buy it as a souvenir.\n\nanother suggestion ,  \non day 1 take a [tokyo cruise](https://www.suijobus.co.jp/en/) from asakusa -> odaiba (\\~15-16.xx)  \nyou can just sit and relax in the cruise for the river view  \nand go eat dinner in odaiba shopping malls  \nand take a train backlater.\n\nfor the sumo,  \nTake the tsukuba express train from asakusa to akihabara,  \nswith to JR chuo-sobu line (yellow) to RYŌGOKU STATION  \njust inside ,around the station you will find many thing related to sumo,  \nand there are Ryogoku Kokugikan National Sumo Arena , which I think gift shop will open for sumo-related merchandise.",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi56pir",
        "body": "Be wary about ramen and curry: most of it is made with meat as a matter of course, including even dishes called 'vegetable' ramen or 'vegetable' curry, because the 'vegetable' means effectively 'more vegetables than usual.'",
        "score": 2,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5ampz",
        "body": "Day 8: Take the whole day off imo\n\nI wish I did. Maybe you've got more stamina/active than I am. But, that one breather day, where you don't have to think about traveling/where to eat, will feel nice.",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5qw52",
        "body": "For Osaka, I would definitely recommend go to Universal studio!! Personally I like universal studio more than Disneyland\n\nIn Universal studio, they have “ the Mario Cafe “ I loved it so much ! \n\nAlso will recommend you could visit Pokémon cafe in Tokyo, super adorable \n\nThis theme restaurants and cafes recommend articles might help you out to figure something out :) \n\nhttps://www.lingoclass.co.uk/best-theme-restaurants-cafes-japan-tokyo",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi6x69x",
        "body": "In Tokyo, we enjoyed Harry Potter Studio Tour and Blue Note.\n\nYou should do Osaka Expo since you're already in Osaka and it's a once in a lifetime experience.",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi73h1a",
        "body": "day 8, is a lot of downtime. at least check out the sculpture garden and find lunch if nothing else.",
        "score": 0,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5o0s5",
        "body": "Do you recommend anywhere where we could watch sumo practice? I know there are no tournaments happening while we are there. \nI think we might move the head spa to Osaka, thank you",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi594n4",
        "body": "Will it be offensive if I ask for “no meat” or more specifically “no pork, chicken, beef”? I am okay with chicken broth for this trip because I understand that may be difficult to avoid, but I would like to stay away from consuming flesh. I also want to be respectful, so if asking to substitute or leave out parts of dishes is offensive I will not order unless I know it’s meat free.",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi70dva",
        "body": "“Vegetarian” is an understood word there.  If you can’t communicate pescatarian to them, I would say vegetarian but seafood is ok.",
        "score": 0,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi6umv9",
        "body": "I think you are probably right, especially following two days at Disney and it being halfway through the trip",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi7lend",
        "body": "There are not many sumo activities that we know, and most of it in japanese site T\\_T.  \n  \nAlso try spa in Tokyo too \n\nshinjuku -[Thermae-Yu ](https://thermae-yu.jp/)\n\nsuidobashi/tokyo dome - [Laqua](https://en.www.laqua.jp/spa/)  \\+ shopping malls  \n  \nI think you might want a foot spa,body massage rather than head spa.  \nyou will walk a lot and your feet get tired first.",
        "score": 1,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5guyy",
        "body": "Japan is not really the culture to be asking for substitutions for food. It comes as it is intended to come.",
        "score": 9,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5gfjm",
        "body": "Some people might be offended or annoyed, with the possible offence or annoyance correlated positively with the prices at the restaurant, but the problem you will face is that for many dishes (ramen and curry in particular) the restaurants will not be able to accommodate you because the basic ingredients of the dishes include meat.\n\nAnother problem is that, even if the restaurant is willing to accommodate you, vegetarianism, veganism, pescatariansim, *et al.* are not well understood even by adults in Japan. Pescatarian myself, I have had servers in restaurants (while we were speaking Japanese) ask me in utter sincerity if ham was meat; just this weekend, three adults I was cooking with were surprised that gelatin and lard were animal products.\n\nI recommend that you just resign yourself to doing without ramen or curry during your trip unless they are specifically promoted as 'vegan'.",
        "score": 3,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi5he4m",
        "body": "There are Reddit threads for Tokyo, Osaka, and Kyoto vegan and vegetarian options. So I would check them out.",
        "score": 2,
        "post_id": "1jcozzc"
    },
    {
        "id": "mi7u9wu",
        "body": "Dashi - made with Bonito flakes (fish flakes) and konbu - is a main ingredient in Japanese cuisine. I've heard vegans talking about how ume onigiri are great and completely vegan. But the truth is that most ume are pickeled with katsuobushi 鰹節 -> fish flakes. Many of my Japanese friends don't get the fact that Dashi, and Bonito flakes (fish flakes), are not ok for vegans and vegetarians. They think it's just seasoning. Veganism and vegetarianism are still very foreign concepts here in Japan. So asking for no meat doesn't mean that there isn't any meat present in the sauce or broth.",
        "score": 1,
        "post_id": "1jcozzc"
    }
]