[
    {
        "id": "mhsrrkt",
        "body": "# Apple Wallet Suica vs New Welcome Suica Mobile\n\nTraveling to Japan soon and trying to figure out which one we'd be better off using. So far, the only difference I see is that the new mobile app let's me buy a 1-day pass for Tokyo while the Apple Wallet Suica is a simple top up and go. Am I missing something?",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mhwc6o5",
        "body": "Hey! Not sure if this is the right place to ask. I'm planning to get a JR Kansai-Hiroshima area pass for my trip between Osaka, Kyoto, Hiroshima and Nara. But I'm arriving to Osaka from Hakone, and from what I read, Shinkansen Odawara to Shin-Osaka is covered by the pass. But I'm not sure if I can exchange my pass at Odawara station and if I need to do so. I will appreciate any advice, also on the best way to get from Hakone to Osaka. ",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mhre2an",
        "body": "Does anyone have any recommendations for Golf Courses near Sapporo that is tourist friendly?",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhruwyk",
        "body": "I'm looking to do a trip down to Fukuoka/Kyushu in November.  The trip will start and end in Tokyo, but searching for options on how best to get from Tokyo to Fukuoka.  The way back will likely be via the Shinkansen as we will make a few stops along the way - but getting there in the first place is the challenge.\n\nSpecifically, there are a few ways to make this trip - train, ferry, or airplane.  The difficulty being that I can't seem to find how to book a flight from Haneda to FUK (or how to pre-book ferries).  I would take any or all advice on this!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhtoitm",
        "body": "Anybody know how to by pass “3D Secure” authentication on SmartEX? Trying to book Shinkansen tickets but it keeps giving me an error. My bank isn’t able to help.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhu3mvh",
        "body": "Do I need JESTA when visiting japan? I just watched a Youtube video, about how it was recently passed as of March.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi0czo2",
        "body": "Okay a few questions about arrival tasks: \n\n1. We are landing at Kansai International Airport. As English only speakers will it be easy to find a 7/11 atm to get cash out,  the counter to buy IC cards at and the airport limousine counter to buy tickets? Are there English signs in airports?\n\n2. Do we need cash to purchase IC cards or can we pay by card? (We have android phones so need physical cards) \n\n3. How much yen should we get out of the atm on arrival? There are 4 of us but we'll use credit cards for payments whenever possible on our trip.\n\n4. We are planning to collect eki stamps in our stamp books, and have read that other places of significance also sometimes have them, not just trains. Does anyone know if thr airports have a special stamp too?\n\nThanks!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi18x90",
        "body": "Hi Guys! It's my first time visiting Japan, looking for feedback on general locations! Going for two weeks.\n\nI'm going in early June and was planning on spending 7 days, 6 nights in Tokyo. After that, one night at a ryokan in Kawaguchiko before moving onto Osaka for 5 nights. During my time in Osaka, I wanted to take a day trip to Hiroshima to check out the Atomic Dome, go another day really early in the morning to check out Himeji Castle and maybe check out Kobe on the way back, unless you guys have suggestions. Then, a day trip to Kyoto.\n\nI would be heading back to Tokyo for the last day before flying out.\n\nIs this too many cities/places to pack in during a two week visit? Pointers are appreciated!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi1xbjm",
        "body": "Asking for a friend currently. They just got denied a rental car, and we're unsure why.\n\nThey are in Japan for around 9 months, has a translation of their license. And has been using it. It's about 7 months in now. But they got told by rental company it's not valid suddenly? \n\nThey seemed to be pointing to the three month rule. Which I thought only meant that the twelve month validity did not reset for shorter trips, eg. first entry still counts as starting point, to stop people from \"renewing\" their twelve-month period by leaving and returning quickly.\n\nIs it really true that the original validity period of twelve months just is cut short and made invalid in it's entirety as well? Eg. for the remaining X months.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi2dxhv",
        "body": "Meds question\n\nMy standard travel kit is always\n\n1. ibuprofen\n2. Paracetamol\n3. Loperamide\n4. Loratadine\n5. Melatonin (3mg)\n\nNow according to the list of the ministry none of this is prohibited, I think, but when I google I get a lot of mixed information on melatonin.  I wouldn't be bringing massive amounts of these into the country, 15 of each tops.\n\nCan someone please enlighten me?",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi33249",
        "body": "Hello, I'm planning a trip to Japan for the 3 weeks in the beginning of october.\nCurrently these are my plans for where to go and the amount of days I'll stay in each city.\nArrive in Tokyo and stay there for 2 nights\nFly to Sapporo and stay there for 5 nights\nFly to Kyoto and stay there for 8 nights\nGet the Shinkansen and go back to Tokyo for the remainder of the days\n\nI have a few questions that I hope some of you can answer.\nIs it rainy in Japan (mostly concernd about Sapporo) in october?\nAre the excursions from Sapporo to the bluepond/geysers/Mount Yōtei available around the date that I'm there?\n\n\nTo keep my expenses on the lower side I want to go to capsule hotels do you have recommendations for places to stay?\nIf you got some extra recommendations about excursions or something else, please let me know :-).\n\nSorry if my english is bad.\nThank you for reading and the replies! :-)",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi5kp7s",
        "body": "hello all! last time i booked for Japan was pre covid and when that happened it was a nightmare trying to get money back from hotels and flights from Expedia.\n\ni’ve forgotten the process, so which is the best way to purchase flights? should i book directly through the airline ANA? \n\nis expedia ok to use for hotels, or how should i book directly with one?\n\n\nfor buying the train pass, i can just buy that with cash there right?\n\nlast question, where do i order the portable hotspot? i got one years ago the first time i was there and i picked it up at the airport when i arrived",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi6i81j",
        "body": "Hello. I joined this sub because it's my first time travelling  to Japan this coming April. We will be staying there for 6 days and 5 nights.\n\nI have some questions for those who already travelled there or are staying there:\n\n1. Approximately how much pocket money per day will I need for 3 meals a day (breakfast, lunch, dinner)?\n2. Do you have any recommended spots to visit in Osaka and if entrance fees or bookings are necessary?\n3. Since we are travelling from April 30-May 5, what is the appropriate outfit to wear based on the season/climate there?\n4. How are the cases of influenza/pneumonia going there? Is it decreasing? There was an outbreak 1-2 months ago.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi7gwev",
        "body": "Hey do the following hotels provide slippers:\n\nDai ichi hotel ryogoku in Tokyo\n\nIbis styles kyoto station in Kyoto\n\nIbis budget osaka umeda in Osaka",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi7unig",
        "body": "Currently in Japan for 6 months on two 90 day visa free stints. I've been dating a girl here and I'm wondering if I can immediately come back to Japan for another 6 months on a WHV? Or do I have to wait 365 days like if I were to return without a visa?",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi8lgl5",
        "body": "Going to Japan for about 5 weeks in June, planning to spend about 7-9 days traveling around Hokkaido. Does one need to rent a car or can I reasonably rely on public transit?",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi8p593",
        "body": "\n\nHi all, we're planning to do some parts of the Kumano kodo in our trip next September. I've been reading on this subreddit and it was very helpful.\n\nThe first day we'd probably leave Osaka in the morning. I'd love to hear your input to help me choose between these two options (or change it altogether!) Mainly, is it more worth it to spend the night in Tanabe, or in the Yunomine onsen area?\n\n  \n**Option 1: extra night at Tanabe at the beginning**\n\n* Day 1: Osaka --> Tanabe. Sleep in Tanabe.\n* Day 2: Tanabe -(bus)-> Takijiri oji -(walk)-> Takahara. Sleep in Takahara.\n* Day 3: Takahara -(bus)-> Hosshinmon -(walk)-> Hongu Taisha\n   * Would love to visit Yunomine Onsen if possible this day.\n* Day 4: Hongu Taisha -(bus)-> Koguchi -(walk)-> Nachi Taisha -(bus)-> Katsuura\n\n  \n**Option 2: extra night in Yunomine in the middle**\n\n* Day 1: Osaka --> Tanabe -(bus)-> Takijiri oji -(walk)-> Takahara. Sleep in Takahara.\n* Day 2: Takahara -(bus)-> Hosshinmon -(walk)-> Yunomine. Sleep in Yunomine.\n* Day 3: Walk to Hongu, and around Yunomine area (Dainichi-goe). Sleep in Hongu Taisha.\n* Day 4: Hongu Taisha -(bus)-> Koguchi -(walk)-> Nachi Taisha -(bus)-> Katsuura\n\n  \nA third option would be to sleep in Nachisan and not in Katsuura, but I've read that accommodation is much better in Katsuura, and that the city itself is nice to spend a night.\n\nAny thoughts on which plan sounds better or if there’s another option I’m not considering? Thanks!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhsvhol",
        "body": "Looking to travel to Japan in November.  Was looking at a travel agency, but it's more expensive than I want to afford.  Especially after signing up for classes.\n\nLooking for advice on how to do this for 2 weeks.",
        "score": 0,
        "post_id": "1jb28og"
    },
    {
        "id": "mi0i401",
        "body": "[removed]",
        "score": -1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhsvxzh",
        "body": "The tourist app is very new, but for normal tourists, it probably makes more sense than getting the regular card via Apple Wallet now. Note the card is only valid for 180 days. Not a big deal ultimately, and the app is intended to make it easier for tourists to do things like attach special passes to the card.\n\nAlso note that having the Welcome Suica app entitles you to some discounts/specials at places throughout the country.\n\nThe regular Suica is intended for normal commuters, and it doesn't expire. You can also the passes you're talking about to the regular Suica via the Suica app, but that app is entirely in Japanese.",
        "score": 3,
        "post_id": "1jb28og"
    },
    {
        "id": "mhx1y7c",
        "body": "Where did you read that? Odawara is nowhere near Kansai. That pass only covers the Shinkansen southbound from Osaka, and the coverage of non-shinkansen trains falls way short of Odawara by several hundred km.\nhttps://www.westjr.co.jp/global/en/ticket/pass/kansai_hiroshima/",
        "score": 3,
        "post_id": "1jb28og"
    },
    {
        "id": "mhs06xz",
        "body": "You book the flight like any other flight. I booked ANA out of Haneda to Kagoshima airport for my trip next month. You can easily book to Fukuoka from Haneda, just load up google flights, who flies there, then go to their site and book.",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mhy2koo",
        "body": "This heavily affects Visa cards and your bank won’t be able to do anything. Mastercard and Amex are usually OK.\n\nAlternatively, use the JR West site.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhwasj4",
        "body": "It’s not going to be in place until 2030: [https://www.news.com.au/travel/destinations/asia/major-change-for-tourists-visiting-japan/news-story/3f3cda0f5ac2edbd4fe218f199df2f4e](https://www.news.com.au/travel/destinations/asia/major-change-for-tourists-visiting-japan/news-story/3f3cda0f5ac2edbd4fe218f199df2f4e)",
        "score": 3,
        "post_id": "1jb28og"
    },
    {
        "id": "mi11y2w",
        "body": "There’s English language signage throughout airports and train stations in Japan.",
        "score": 1,
        "post_id": "1jb28og"
    }
]