[
    {
        "id": "mi1lb4k",
        "body": "Q1 You'll have plenty of English signs, and often even English speaking staff at major transport hubs in all the large cities.\n\nQ2 There are machines where you might be able to buy an IC card with credit card, but I'm not sure about Osaka airport. Most require cash, and you'll definitely need cash for any top ups anyway.\n\nQ3 Hard to say without any details of your trip. For our family of 3, our most recent trips needed less than 100k yen for a 2 weeks, mainly in the larger cities.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi7bvu5",
        "body": "you'll want to carry cash regardless or be willing to go to an ATM to pull out more any potential day. many places still only take cash.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi1ja83",
        "body": "I'd suggest staying overnight in Hiroshima and visiting Himeji on your way there or back. There's lots to see in Hiroshima. Kobe looks pretty uninteresting compared to Osaka and Hiroshima.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi7bqlc",
        "body": "usually the international driver permit is only valid for one year. is your friend sure it's still valid? Like if they got it a few months before leaving on the trip, it could be expired now.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi4kcc9",
        "body": "Stick to the official government websites. If drugs aren’t on the official list of prohibited or controlled substances then there’s no restrictions on them.",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mi8g0nv",
        "body": "Q1 You can eat for pretty cheap. 5000 yen per person per day can get you reasonable food, but you can go down to half if you eat like a student. \n\nQ2 https://www.japan-guide.com/e/e2157.html\n\nQ3 I'm in t-shirt and shorts for a good number of days at the end of April, although have a light jacket in case the weather turns. \n\nQ4 1-2 months ago was the start of the northern hemisphere winter, there is *always* a flu outbreak in the region. And it always lessens as it gets warmer. If you're paranoid, get your flu shots and wear a mask because lower risk =/= no risk.\n\nBonus Q You're travelling in the midst of Golden week. Make sure you read up on what that means for where you're travelling or visiting.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi87m9m",
        "body": "Why not email them and ask?",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mht33dr",
        "body": "Yes, you can travel more cheaply if you organise everything yourself. And it's not hard; pretty much everyone on the sub is an independent traveller.\n\nHow much can you afford and what do you intend to do? It is still an international holiday so you will still spend what most people consider a large amount of money.",
        "score": 3,
        "post_id": "1jb28og"
    },
    {
        "id": "mhthkqn",
        "body": "Doing classes and organised tours always add a lot to the cost of travel.\n\nJapan is an advanced economy, so the overall costs of visiting are going to be substantial even if you’re from a country with a good exchange rate.\n\nYou can save money by organising things yourself, skipping tours and the like and limiting how much you travel between cities. Business hotel chains can provide good value accommodation, but expect tiny rooms. If you’re on a tight budget hostels might be an option.",
        "score": 3,
        "post_id": "1jb28og"
    },
    {
        "id": "mhzuzvc",
        "body": "There are a bunch of guides available - I'd personally start with [japan-guide.com](http://japan-guide.com) and look at their recommended itineraries. You can easily spend less than $7,000 (or even $5,000) for the month planning it yourself. It can feel overwhelming to start, but there's a lot of help out there for Japan.\n\nSomething I like to do when I have free time is look at a city on Google Maps and select its \"attractions\" filter to see what's out there. I save everything to a list and then use what I saved when I'm actually there to figure out what I want to do of a day.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi0c981",
        "body": "Just look at an example itinerary and book it yourself. I find this was half the price. Obviously it takes more of your time, that's why it costs more to pay an agency to do it for you.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi10juv",
        "body": "Hire a photographer rather than expect random people to offer to do this for you for free",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mht0kns",
        "body": "This is very helpful, thank you so much! Welcome Suica app it is!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhs2dn2",
        "body": "I tried this through the JAL site and it just didn't want to let me book anything that was domestic in Japan.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhy3msz",
        "body": "I actually figured it out. It seems like it’s a bank authentication issue rather than visa thing. I switched from using my Chase card to Bank of America and it worked!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhxp53c",
        "body": "Thank you very much!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi1l6n5",
        "body": "That's an excellent suggestion and I don't know why I didn't think of it that way. Thanks!",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mi4o6kn",
        "body": "thanks!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhtrjs1",
        "body": "I was looking at $5000 to travel by myself.  Looks like it's $7K through the travel agency.  And I admit I want to enjoy myself while I'm in japan.  But 7K does feel expensive to me.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi19ln4",
        "body": "He said he'd be happy to pay for their time.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhs2sep",
        "body": "Were you on the .jp site? If not, try that.",
        "score": 2,
        "post_id": "1jb28og"
    },
    {
        "id": "mhw6dm9",
        "body": "i was able to book through the JAL site just a couple weeks ago for this coming week. you must be looking at the wrong site. ",
        "score": 0,
        "post_id": "1jb28og"
    },
    {
        "id": "mi19gz9",
        "body": "After flight tickets and hotel rooms for 2 weeks (splitting hotel room costs), I am still spending under half of that. For you, it shouldn't be over $3,000 for those alone, unless you are staying in nice/fancy hotels. Where did you get $5,000 from? Should be more than enough.",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mhsao1x",
        "body": "Hmm, I think I found the problem - I was trying to book too far in advance.  I tried with some closer dates and it appears to be working as intended!",
        "score": 1,
        "post_id": "1jb28og"
    },
    {
        "id": "mi7nyj5",
        "body": "This appears to be a post regarding hiking or visiting Mt. Fuji within the climbing season.\n\nSome of the most commonly asked questions on this subreddit regarding Mt Fuji and climbing in season can be found [here in our FAQ.](https://www.reddit.com/r/JapanTravel/wiki/advice/nature/fuji/)\n\nWe also have some really helpful information from Gary J. Wolff, a frequent climber who has written an [excellent guide on his website for climbing Mt Fuji.](https://www.garyjwolff.com/climbing-mt-fuji.html) There is also a link for the [Official Mt Fuji Climb Website](http://www.fujisan-climb.jp/en/) in Shizuoka Prefecture, which can help you with relevant information when you are on the ground, like weather conditions and trail closures. \n\nHappy Planning!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jd51qy"
    }
]