[
    {
        "id": "mi7jqp3",
        "body": "TopTen has a good range of sizes, up to a Korean 4XL (120).",
        "score": 7,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7ggt4",
        "body": "Get an XXL and it's basically a \"western\" XL.",
        "score": 5,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7tfbj",
        "body": "Oversized clothes are pretty popular there so you should have no problem finding XL sizes, at least in shirts",
        "score": 2,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7vv7t",
        "body": "Yes. Theyre super common. I wear american L to XL and I have no issues shopping for clothing. For the record im 185cm and 85kg. \n\nMost mainstream stores will sell clothes in that size. Its 110 (US LARGE) to 115 (US XL). But for Korean brands US L is typically Korean XL and US XL is XXL.",
        "score": 2,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7hjmt",
        "body": "I wear XL in the states, 245lb at 5’11 and I’m probably the largest person anywhere I go in Korea. \n\nI don’t really have a problem buying clothes in Korea but I goto big chains like Uniqlo to buy them. Never really tried smaller stores.",
        "score": 4,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7sp0r",
        "body": "No Korean xl is equivalent of a medium us size and will have shorter sleeves or pant legs. \n\nDo not believe size charts. I’m 6’1.5” and 220lbs. 4-7xl  are the only sizes that can fit comfortably everything under 4xl is tight and short.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7rx4p",
        "body": "Yeah, your wife’s not wrong—Korean sizes definitely run smaller, so an American XL can be tough to find in regular stores.   \n  \nItaewon is probably your best bet since a lot of stores there cater to foreigners and carry bigger sizes. There are also specialty big-size stores like Boovoom and Okkane that go up to 3XL or even 6XL. Uniqlo and some international brands might have XLs that fit more like a U.S. large, but if you're shopping at local brands, you’ll probably need to size up to 2XL or 3XL. Definitely doable, just takes a bit more effort!",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi8799a",
        "body": "You can find “big size” stores in Itaewon.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi88j02",
        "body": "Some costcos will have xxl which is close to xl",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi8h2zl",
        "body": "I found some \"free\" size trench coat style  jackets at M playground which fit me. I'm usually XL or XXL. \n\nIf it has F for the size it should fit everyone. (Apparently)",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7spqj",
        "body": "lol no.xxl may be equivalent of a large size in some cases and not even that in others.",
        "score": 0,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7swpt",
        "body": "Sorry you aren’t the largest foreigner. Not even close.",
        "score": 2,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7wasc",
        "body": "I'm 6'1 and I can easily find pants. Do you have a super long inseam or something? I usually wear 32\\~34 inseam jeans and ive never had issues.\n\n6'1\" in tall, but still in the normal range in Korea.",
        "score": 3,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi86ijv",
        "body": "I am European and usually wear XL. XXL shirts fit fine. XXL Jackets however you definitely need to try on as they are may be tight, depending on the brand.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi7vwzn",
        "body": "xxl is usually a US XL unless you like your clothes baggy.",
        "score": -2,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi80hmm",
        "body": "34 inseem is difficult to find. Even 32 isnt really easy they tend to be about 31 - 31.5 at best. \n\nAside from 4XR and similar specific big and tall shops it’s not common for the average clothing stores to sell a size I can wear. And the specific big and tall shops aren’t conveniently located near my work or home so getting to them is troublesome. \n\nSo I would never say it’s easy to find bigger  sizes in Korea.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi80lbp",
        "body": "lol no. Not even close. You may have gotten lucky but in 8 years of living here it’s more failure than success with sizing.  Your statement assumes people are of a thin build and just tall. It doesn’t account for tall and large",
        "score": 0,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi81rnw",
        "body": "I cant talk about your shirt sizes, but pants.. I'm within half an inch of you in height, and I can find pants super easily as a 32\\~34 inseam person. I can usually walk into any store and walk out with pants that fit properly. \n\nWaist size, I can see anything above a 36 being an issue, shame for shirts. Anything over maybe xl to 2xl US.  But at 6'1\" (185cm), its never been a real issue.\n\nMaybe you just like wearing your pants higher and longer then me.",
        "score": 3,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi81dxj",
        "body": "I was born here... And I'm not thin. I wear a US L to XL depending on the brand. Korean brands I wear xl to xxl for shirts. I've never had an issue with sizing.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi8obwl",
        "body": "Where are you getting pants with a 34 inseem that has a waist line over 34 ? I have long legs.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi8pmnd",
        "body": "Hyundai Department store? I also just did a quick search on 무신사 which is probably the biggest online shopping clothing mall in Korea and 34 inch inseam    search gave me around 1700 results.",
        "score": 1,
        "post_id": "1jd3uat"
    },
    {
        "id": "mi86xw4",
        "body": "If both of your parents were Korean Citizens when you were born, you are also a Korean Citizen (by birth).  If you did not renounce the Korean Citizenship at/by 18, you cannot renounce before you are 38.\n\nIf you are still a Korean Citizen, technically it is illegal for you to enter Korea on a foreign passport (although many do).\n\nJust curious, what nationality did your parents have when you visited Korea with them (age 7-10)?  I'm surprised you weren't stopped then, as they either would have had a Korean passport or a US passport that said place of birth = Korea.\n\nThere's some chance the system has flagged you.  If you (illegally) enter on a US passport / tourist visa and the place of birth is USA, you will more likely than not be OK, but it's not 100% guaranteed.\n\nYou should have either renounced or filed for military service deferral.  You can either try to go sort all of this out / clean it up or take your chances.",
        "score": 9,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi87ahg",
        "body": "Although I'm female, I recently had to look up a lot of the information on dual citizenship because of some visa issues. Here's some of the info I know.\n\nIf your parents were Korean citizens at the time of your birth, you technically automatically had dual since birth. Your parents were supposed to register your birth (but mine also didn't know to do that either). As someone who's male, you could only renounce the Korean citizenship before March 31st of the year you turn 18. \n\nIf at any time you are wanting to stay for an extended period of time in Korea and need a visa, you will not be able to get one as you are required to formally file for the Korean citizenship and fulfill your military duties. However, there are ways to be exempt under special circumstances. Here's the [Embassy of Korea page for the US](https://overseas.mofa.go.kr/us-en/brd/m_4503/view.do?seq=713251) on nationality that I found. But this [Embassy of Korea page for Switzerland](https://overseas.mofa.go.kr/ch-en/brd/m_20340/view.do?seq=32&page=1) is a lot more clear and digestible.\n\nFirst, you should find out if your parents have registered your birth with the Korean consulate or not. As far as I know, if you're on file, even a short trip has the potential to flag something at immigration control (since you're supposed to enter and exit Korea with a Korean passport as a dual citizen).",
        "score": 5,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8dil6",
        "body": "Hey OP, the best thing you can do is to ask your parents if they registered you to the National Family Registry when you were born. If they didn't then they have no record of you and you won't have dual citizenship and just go. \n\nIf they did, then you have dual citizenship and you can only denounce your korean citizenship before you hit 18 years old and after 37 years old and nothing in between. Since you are 27, there is a chance that you will be forced to complete military service. \n\nSO what you need to do is postpone your military service until the age of 38 then denounce your citizenship.\n\nI don't know if this is an AND or OR with the above statement but you can/should get an overseas travel permit (i guess this is a long term one?)\n\nQuote from official link pdf file: \nhttps://www.mma.go.kr/boardFileDown.do?gesipan_id=160&gsgeul_no=1487113&ilryeon_no=1\n\n\"A conscription candidate may receive overseas travel permit if he…\n- Lives overseas with his parent who has permanent residence permit or citizenship\n - Has lived overseas with his parents since before he turned 24 \n- Has lived overseas continuously for 10 years or more years Those whose parents live in Korea are not included. \"\n\nCheck out the link for more info. \n\nI personally wouldn't risk just going. Take couple of hours gathering the necessary forms etc and file it with your local korean consulate. Better than taking the risk and serving nearly 2 years.",
        "score": 2,
        "post_id": "1jd7d0b"
    },
    {
        "id": "mi8ops0",
        "body": "Apply for your Korean passport and find out. You can’t travel to Korea legally as a citizen with any other passport.",
        "score": 1,
        "post_id": "1jd7d0b"
    }
]