[
    {
        "id": "mi2lab7",
        "body": "Please carry and wear a face mask during a cherry blossom season. Yellow dust (황사) and ultra-fine dust (초미세먼지) are insane during the season and they cause pulmonary inflammation and are retained longer in the lungs.",
        "score": 17,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3dks9",
        "body": "Awesome. Looks like the expected peak blooming is around the same time I'll be in Seoul",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3o3j2",
        "body": "We will arrive in Jeju March 24th. I will try to update here.",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi39wbo",
        "body": "I'll be in South Korea from Apr 14th to 20th visiting Seoul, DMZ, and Nami Island. What are my chances to see cherry blossoms?",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3i18d",
        "body": "Will be there only on 20th 😭😭😭😭",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3oc2z",
        "body": "Hi travelling to Seoul from March 30th to April 3 for cherry blossom season. We will hit up all the usual cherry blossom spots in Seoul like Yeouido, Seokchon Lake, Seoul Forest etc.\n\nBUT one of the days we're planning to head to Jinhae Cherry Blossom Festival on April 1st from Seoul.\n\nHad a few questions:  \n  \nFor those that have done the trip in one day is it really hectic timing wise?\n\nFrom my research it seems like it takes 3 hours if we take the KTX from Seoul Station to Changwon-Jungang (2.5 hours) then a taxi (20 mins) to Jinhae. Is this the quickest way?\n\nThe train schedule looks a bit funny because I see the first train is 8:23am but the train before that is 5:03am or 5:38am? Nothing in between?\n\nWe will be staying at the Grand Hyatt in Seoul so we are  only 7 mins away from Seoul Station via taxi.\n\nMy thinking is in Jinhae I would like to 'try' to do all 3 things:\n\n\\- Short hike to Jangboksan  \n\\- Walk the Dream Road (I read I can reach that via the hike)  \n\\- Visit the cherry blossom festival\n\nI keep hearing that if we do it in a single day it will feel very rushed but mathematically in my head I imagine:\n\n8:23am early train from Seoul Station for Changwonjungang (but if can leave 6:30/7:00am even better)  \n11:17am reach Jinhae\n\n\\- Hike maybe 2-3 hours + walk Dream Road  \n\\- Visit cherry blossom festival + snack on some food for say 2-3 hours max\n\nSo technically we'll be done say latest by 5pm-ish and take the 6:14pm train and be back in Seoul by 9pm-ish. If we can take an earlier 6:30/7:00am train then maybe we can even be back by 7pm-ish.\n\nDoes this sound like a fair and realistic plan?",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi1sv5e",
        "body": "There’s an entire floor in Hyundai Seoul mall dedicated to pop ups and they have an amazing selection to browse through all the stalls. Highly recommend. I think it’s called the [creative ground](https://www.ehyundai.com/DP/lang/en/DEP000002.do?branchCd=B00140000) floor (select the floor on the left to view vendors).",
        "score": 14,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1irc6",
        "body": "8seconds, Musinsa",
        "score": 6,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi18w8d",
        "body": "Musina",
        "score": 10,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi2hy7z",
        "body": "I really like andar- in my opinion it’s like an affordable Lululemon",
        "score": 5,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1flkx",
        "body": "North face has the White Label line exclusive to Korea if you wanted to stick with something more familiar",
        "score": 6,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1exdd",
        "body": "For North Face kind of clothing (and boots, bags, etc.), I'm very partial to Millet, which was French brand bought out by a Korean company. Their prices are reasonable - and awesome when they are heavily discounted.",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1g69x",
        "body": "Northface - Discovery (for outerwear)",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1if08",
        "body": "Topten",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1kkm6",
        "body": "This thread mentioned a bunch of interesting ones.\n\nhttps://www.reddit.com/r/Living_in_Korea/s/FwtSioeGok",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1uega",
        "body": "8seconds Musina are very much in the realm of Uniqlo. There are many local brands that resembles aritiza everlane and such. Pureda, blossom, indiebrand, VYUR. The Hyundai mall Yeouido-dong in Basement floor will have lots of pop up stores with these local brands that will fall into the category of aritizia everlane and etc.",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi3avf6",
        "body": "Emis, Mardi, Marithe, Open YY, post archive, ajobyajo, paragraph, andersson bell, LMC, Thisisneverthat, Matin Kim, Raive, Grove, Amomento, Ader error, Covernat, Satur, Glowny, Rokh,",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1ch0a",
        "body": "following",
        "score": 1,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi2v2kz",
        "body": "There’s a brand called Raw Row that makes cool bags n stuff. Minimal, fairly cheap, nylon, functional. https://worldwideworld.kr/product/list.html?cate_no=965",
        "score": 1,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1ancq",
        "body": "commenting because I want to know this too!",
        "score": 1,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1ldd4",
        "body": "Following",
        "score": 0,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1ymio",
        "body": "Interested in this too!",
        "score": -1,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi1j8xz",
        "body": "[Korean fashion brands](https://namu.wiki/w/%EB%B6%84%EB%A5%98:%EB%8C%80%ED%95%9C%EB%AF%BC%EA%B5%AD%EC%9D%98%20%ED%8C%A8%EC%85%98%20%EB%B8%8C%EB%9E%9C%EB%93%9C)",
        "score": 2,
        "post_id": "1jcctz7"
    },
    {
        "id": "mi3ys33",
        "body": "5c is cold. If you’re not used to cold, wear layers. A down coat can be useful, but they’re bulky. Several layers, scarf, hat, gloves will be useful, but it also depends on how much you’ll be walking",
        "score": 1,
        "post_id": "1jcnder"
    },
    {
        "id": "mi422xh",
        "body": "Guess the temperature difference between day and night is gonna be pretty big so best to layer up and throw on a light padded jacket and bring a hat\nFor street food so many options but if you don’t mind sweet red bean filling you should try bungeoppang kinda fish-shaped pastry people here love it the most popular winter snacks",
        "score": 1,
        "post_id": "1jcnder"
    }
]