[
    {
        "id": "mi2lab7",
        "body": "Please carry and wear a face mask during a cherry blossom season. Yellow dust (황사) and ultra-fine dust (초미세먼지) are insane during the season and they cause pulmonary inflammation and are retained longer in the lungs.",
        "score": 35,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3o3j2",
        "body": "We will arrive in Jeju March 24th. I will try to update here.",
        "score": 7,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3dks9",
        "body": "Awesome. Looks like the expected peak blooming is around the same time I'll be in Seoul",
        "score": 3,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3oc2z",
        "body": "Hi travelling to Seoul from March 30th to April 3 for cherry blossom season. We will hit up all the usual cherry blossom spots in Seoul like Yeouido, Seokchon Lake, Seoul Forest etc.\n\nBUT one of the days we're planning to head to Jinhae Cherry Blossom Festival on April 1st from Seoul.\n\nHad a few questions:  \n  \nFor those that have done the trip in one day is it really hectic timing wise?\n\nFrom my research it seems like it takes 3 hours if we take the KTX from Seoul Station to Changwon-Jungang (2.5 hours) then a taxi (20 mins) to Jinhae. Is this the quickest way?\n\nThe train schedule looks a bit funny because I see the first train is 8:23am but the train before that is 5:03am or 5:38am? Nothing in between?\n\nWe will be staying at the Grand Hyatt in Seoul so we are  only 7 mins away from Seoul Station via taxi.\n\nMy thinking is in Jinhae I would like to 'try' to do all 3 things:\n\n\\- Short hike to Jangboksan  \n\\- Walk the Dream Road (I read I can reach that via the hike)  \n\\- Visit the cherry blossom festival\n\nI keep hearing that if we do it in a single day it will feel very rushed but mathematically in my head I imagine:\n\n8:23am early train from Seoul Station for Changwonjungang (but if can leave 6:30/7:00am even better)  \n11:17am reach Jinhae\n\n\\- Hike maybe 2-3 hours + walk Dream Road  \n\\- Visit cherry blossom festival + snack on some food for say 2-3 hours max\n\nSo technically we'll be done say latest by 5pm-ish and take the 6:14pm train and be back in Seoul by 9pm-ish. If we can take an earlier 6:30/7:00am train then maybe we can even be back by 7pm-ish.\n\nDoes this sound like a fair and realistic plan?",
        "score": 3,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi7wf8r",
        "body": "Hi! Is there a website where people post photos of cherry blossom sites real time? 🥺 planning to go to Busan on the 26th! Hopefully I find some blooms by then",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8g7ph",
        "body": "I’ll be in Jeju 3/20-3/23. Will let you all know what I see",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi39wbo",
        "body": "I'll be in South Korea from Apr 14th to 20th visiting Seoul, DMZ, and Nami Island. What are my chances to see cherry blossoms?",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi3i18d",
        "body": "Will be there only on 20th 😭😭😭😭",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi6yhkd",
        "body": "We only arrive on the 22nd. How’s it like then?",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi4pxok",
        "body": "I am traveling in 3 weeks and found this site tracking air quality https://aqicn.org/city/seoul/",
        "score": 6,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi6bmyu",
        "body": "Is that because of the cherry blossoms or because of things just blooming in general? Is that dust or pollen the same as other parts of the world? Is there anything about the pollen in Korea that makes it unique?",
        "score": 3,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi5hohp",
        "body": "Sounds good 👌",
        "score": 3,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8nof0",
        "body": "Check on schedule festival, I've visit Jinhae long time ago. At that time there were Festival Host by Marine Corps and Shinee are the guest performance. I decided to watch and stay overnight there, back to Seoul with first train on next morning.",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8rqli",
        "body": "I search locations on Instagram and sort by recent posts to see if cherry blossoms are at their peak",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8rjcs",
        "body": "I'm afraid the chance is very low:(",
        "score": 1,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8cs2a",
        "body": "No it's not because of pollen. It is mostly because of pollution and desert sand blowing over from China/Mongolia during this time of the year.",
        "score": 2,
        "post_id": "1jcj1s6"
    },
    {
        "id": "mi8szy1",
        "body": "It's like less than 45 mins on the KTX..I would do a day trip.",
        "score": 3,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8u0ib",
        "body": "Yes, you can do a day trip there.  But you'll miss a lot of stuff.  ",
        "score": 2,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8tq04",
        "body": "It is doable if you are willing to start early. I would recommend taking a taxi to see Bulguksa. Otherwise, all of the sites in Gyeongju are in close proximity. I would still recommend taking a taxi to the town; the town is walkable.",
        "score": 1,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8v3j6",
        "body": "Worked for me. Arrived there at around 11 am. Had a hard time spending the rest of the time for my train at 10 pm",
        "score": 1,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8wque",
        "body": "If you have a particular interest in history I'd say stay the night. It's probably doable as a day trip if you're highly organised, but if you're taking public transport, and spending time in the museums, and thinking of taking a trip out to Bulguksa, you do really need two days.",
        "score": 1,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8vfh5",
        "body": "What taksi pp should i use in Korea? Uber? How easy it is to get taxi using the app, and what is the general level of english spoken in Busan and Seoul?",
        "score": 0,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8x0q2",
        "body": "You can hail one from the street or take it from\nThe stand. Never had an issue with this. I find that English is not spoken much. I always had a hotel card with me indicating where I wanted to go.",
        "score": 1,
        "post_id": "1jdakms"
    },
    {
        "id": "mi8zi0j",
        "body": "부산동부터미널\n\n[https://naver.me/5FmdcojQ](https://naver.me/5FmdcojQ)",
        "score": 2,
        "post_id": "1jdbi2p"
    },
    {
        "id": "mi90tit",
        "body": "Thank you SO much!!! \nIs there any way you can figure out what time she is arriving? \nI can’t find it on the ticket and it’s all I have",
        "score": 1,
        "post_id": "1jdbi2p"
    }
]