[
    {
        "id": "mi7qv1z",
        "body": "Finally, some reasonable attempts to address the impact of overcrowding on the locale.",
        "score": 27,
        "post_id": "1jd51qy"
    },
    {
        "id": "mi7nyhq",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jd51qy"
    },
    {
        "id": "mi8hchl",
        "body": "Precisely - this is good.",
        "score": 3,
        "post_id": "1jd51qy"
    },
    {
        "id": "mi7zuro",
        "body": "You think having people pay will less the overcrowding?\n\nIt's just to fill the pockets of certain people. The trash will not be cleaned up, the money will not be spent on what it is collected for.",
        "score": -19,
        "post_id": "1jd51qy"
    },
    {
        "id": "mi827bn",
        "body": "Well, it would reduce the type of traveller who finds it expensive. You’d be surprised how many slum it and dirty various places.\n\nI don’t claim that it would be a perfect solution and definitely not every cent may be well-utilised.. but a signal has to be sent. More heritage nature places worldwide ought to do the same.",
        "score": 13,
        "post_id": "1jd51qy"
    },
    {
        "id": "mi6fjay",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jczme4"
    },
    {
        "id": "mi8avns",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jd8805"
    },
    {
        "id": "mi5jj4r",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5o333",
        "body": "Maybe I'm misreading these, but I'm seeing like...17 travel days in a 22 day stretch. And 20 different cities? It's a lot. You're going to end up crossing a lot of cities and sites off your checklist, but I don't think you'd be allowing yourself to experience much of any of them.",
        "score": 10,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5rvy2",
        "body": "I hope you like trains, because it seems as if you're going to be spending a quarter of your waking hours on them.",
        "score": 10,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5t2mm",
        "body": "If you want then you on day 9 you can walk from Honshu to Kyushu via undersea tunnel",
        "score": 3,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi6vlhj",
        "body": "I have nothing of value to say but want to praise how beautifully you formated this post.\n\n\nIn a sub where 90% of people put 0 effort into making their itineraries readable for others, this is a gem.",
        "score": 2,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5tc1i",
        "body": "Thanks! I guess you're not misreading—it really is 20 locations in 3 weeks. \\^\\^'\n\nThe first exclusion I'd consider is dropping Shimonoseki and spending more time in Kagoshima. Another option would be skipping Matsumoto, which would give us more time in Fujikawaguchiko or Hakone.\n\nAlternatively, removing the entire Kyushu or Alps portion would make the trip more relaxed. However, while my girlfriend and I will probably visit Japan again, the third person may not have the chance anytime soon, so it feels somewhat justified to push the itinerary a bit more.\n\nWhat would you drop from the schedule to make it more manageable?",
        "score": 2,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5vnso",
        "body": "Hard pill to swallow but I came for this type of comments! Thanks!",
        "score": 2,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5u2nz",
        "body": "TIL thanks! It's kinda hilarious tough:D",
        "score": 2,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi65nrg",
        "body": "I just noticed you said end of March. This year? That could affect your plans, of course. If so, you've purchased plane tickets already, I assume.\n\n\n>What would you drop from the schedule to make it more manageable?\n\n\n22 nights is a really great amount of time to have in Japan. You have a ton of flexibility, but I would drop enough cities that it would look like a totally different itinerary.\n\n\nSince you mentioned Yakushima and that's my favorite non-Tokyo location in Japan, I'd recommend 3-4 nights. You'll want to rent a car, though. If you went with that, and based off the cities you do have on there, I'd recommend something like:\n\n\n7 nights Tokyo (1-2 day trips)\n\n6 nights Kyoto/Osaka (1-2 day trips)\n\n2-3 nights Fukuoka\n\n3-4 nights Yakushima\n\n\nThese four locations are actually very convenient to group together, as you can get direct flights to/from Yakushima via both Fukuoka and Osaka.\n\n\nThis would leave you with 2-4 nites to play with. You could add in Hiroshima/Miyajima or somewhere else or an extra day in Tokyo or Kyoto/Osaka if you wanted to do another day trip. \n\n\nI'd try to get all of Tokyo on the backend, if possible. In the past, my wife and I arrive in Tokyo very early, stay in the airport, and catch a flight to Fukuoka. Stay there a couple nights, then fly to Yakushima for 4 nights, then off to wherever.\n\n\nJust some ideas to ruminate on.",
        "score": 3,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5udx4",
        "body": "Yep, on the Kyushu side there is also small train you can take in direction of normal trains ;)",
        "score": 1,
        "post_id": "1jcvuk8"
    },
    {
        "id": "mi5quzu",
        "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi6u7g3",
        "body": "Way too busy, especially the Kansai part. Have you tried pinning down the locations and checking out how much time it takes to travel between locations? And on top of the already way-to-packed itineraries in Kyoto, you'd have to travel back to Osaka at the end of the day. You're spending more days in Kyoto than Osaka, so why are you staying only in Osaka for your Kansai leg?\n\n1. You won't have time to spare for USJ.\n\n2. Not sure if you mean sento, or public baths, instead of onsen. There's not much onsen available at Tokyo, Kyoto and Osaka, which is why people travel out to visit onsen towns. The closest and easiest onsen you can travel to in Kansai is Arima Onsen at Kobe.\n\n3. No. No. They'd have towel rentals if you're doing day trips. You don't wear swimsuits into the onsen. You'd have to get comfortable doing so in your birthday suit.\n\n4. If you can, why not? Skips the queue and some may be cheaper if purchased online.\n\n7. Shops will indicate they have tax-free options for foreigners.",
        "score": 4,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7iqtv",
        "body": "1) USJ should be a full day in my opinion. Some people will do 1/2 day to only do SNW. I personally wouldnt but if persons love Mario that much to spend that money to do 1/2 day then props to them. I've done crazier things in life. I just dont suggest it as i think the park deserves a full day as it has so much to offer.\n\n2) If you are asking then if its worth a day  again it depends on you. I know a lot of people strangely ask if they should go to USJ. I then ask, why is USJ on thier itenary to begin wtih. Dont go because people suggest you go . Go because you want to enjoy a theme park or you like thier characters/IP (Mario, Harry Potter, Jaws, Jurrasic Park, Minions, coasters etc).",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7q8av",
        "body": "Kinkakuji does not open early morning.  Only from 9 am, which I don’t consider early morning for Kyoto……",
        "score": 2,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi6vtys",
        "body": ">Way too busy, especially the Kansai part\n\nThe Kanto part is also way too overpacked, with the same basic issue (going back and forth around the city without grouping locations). A good third could be cut and it would still be very busy.",
        "score": 4,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7r1or",
        "body": "Honestly I tried to stack as much things as I could. I pinned everything on the google maps and tried to put them in a day. It is a rough concept. Only thing I haven’t really paid a lot of attention to is traveling between points but at most 20-30 minutes, they would be (With few exceptions at Tokyo)\n\nI am mainly staying in Osaka because it was cheaper, I will also travel to Nara and Kobe, I also heard bars, pubs of Osaka is more fun than Kyoto at evening.\n\nWhat is the difference between a sento and onsen? What sentos would you suggest in Tokyo - Osaka?\n\nThank you for the answers!",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7qm05",
        "body": "I am a huge movies fan, even consider myself to be a cinephile to a certain extent. I haven’t been to a theme park before (Unfortunately, that is not a thing at where I live)\n\nSo my question is, is it worth it over spending a day in Osaka? I feel like, it is not. So I will probably skip that one..\n\nThanks for the answer!",
        "score": 1,
        "post_id": "1jcwowv"
    },
    {
        "id": "mi7qfgu",
        "body": "Thank you for the information, I will just replace things within the day! This is more of a general concept than a fully detailed, must do list.",
        "score": 1,
        "post_id": "1jcwowv"
    }
]