[
    {
        "title": "Weekly Japan Travel Information and Discussion Thread - March 07, 2025",
        "id": "1j5se26",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j5se26/weekly_japan_travel_information_and_discussion/",
        "score": 5,
        "comments": [
            {
                "id": "mgpbsm7",
                "body": "We will be staying at Hotel Toranomon Hills. Easier to take the limo bus to the andaz and walk  or take the Narita Express to Tokyo Station and grab a taxi? We will arrive at 4:30pm on a Thursday.",
                "score": 2
            },
            {
                "id": "mh4romq",
                "body": "I'm going alone to Tokyo and Kyoto in a month, I'm a 30yo man and I'm starting to freak out about it, like what if I get lost, or something happens to me, please reassure me :(",
                "score": 2
            },
            {
                "id": "mgkvchv",
                "body": "Will be staying in Hyatt House Shibuya, whats the best way to get to Hakone? Is it better to:\n\n- Go to Shinagawa, take Shinkansen or Shonan-Shinjuku line?\n- Go to Shinjuku, take Shinkensen or Romancecar?\n\nWill not be getting round trip for Hakone pass.",
                "score": 1
            },
            {
                "id": "mgkxl0u",
                "body": "considering going to tokyo with 5 other adults and 5 total kids. Is there a inexpensive place around/in tokyo that we could all get reservations at? ages are between 40-50 for the adults and 13-18 for the kids.",
                "score": 1
            },
            {
                "id": "mgmul2k",
                "body": "Thinking of planning a trip from Tampa to Tokyo in June since it's around my birthday (hitting the big 30). This would also be my first time leaving the country as an adult and I'm starting the passport process this Monday. Is there anything I should know about Japan climate-wise around that time of year? I hear it can get very humid/hot, even compared to Florida's summers.\n\nI've watched and read plenty of travel tips over the years for Japan specifically, but that's obviously not gonna give the whole picture. Anyone have tips for a solo first-timer? Besides the obvious staying out of trouble, don't be rude, etc. And if anyone has any tips on saving on plane tickets (the prices don't seem to budge much when traveling from east coast, but worth asking), lemee know!",
                "score": 1
            },
            {
                "id": "mgosbe2",
                "body": "Am I able to ride the Hayabusa with no extra charges with a JR East South Hokkaido pass? Or am I only able to do that with a regular JR Pass?",
                "score": 1
            },
            {
                "id": "mgqnqne",
                "body": "Where do I go through customs? I'm flying from the USA to Haneda, and then after Haneda, I have a flight transfer to Hokkaido (Memanbetsu), which is my final stop. Am going to go through customs in Haneda or in Hokkaido?",
                "score": 1
            },
            {
                "id": "mh14pkn",
                "body": "Anyone have experience with expedited medication approval? Only found out about it a couple days ago and I'm leaving this Thursday. Tried to send in the documents and they replied that it was too soon, but I've seen others say they can get it done as quick as 24 hours and that I should press them on it? It's just vyvanse so nothing crazy. Could just throw it in my bag and I figure they won't go that hard scrutinizing",
                "score": 1
            },
            {
                "id": "mh15r3f",
                "body": "For a trip that starts/ends in Tokyo, where would you fit in Hiroshima? I do not want to go to Hiroshima upon landing or the next day. We are planning 5 nights in Tokyo upon arrival, then will go to either Kyoto or Hiroshima. But which? And, yes, skipping Osaka…\n\nTokyo -> Hiroshima -> Kyoto -> Tokyo\n\n\nTokyo -> Kyoto -> Hiroshima -> Tokyo",
                "score": 1
            },
            {
                "id": "mh3sngm",
                "body": "Well I fucked up and didn't get on early enough and missed out the pass I wanted for USJ time to line up in the single person line and pray for the best",
                "score": 1
            },
            {
                "id": "mh6jrk4",
                "body": "JESTA question (possibly another, sorry). I’m from one of the 71 visa exempt countries and believe everything is still fine. I have seen the news about JESTA coming in to force in 2030 but now see 2025 being mentioned. Do I need to get a visa before travelling, or sort JESTA out now, or am I still good. I have used the search bar at the top but only see two posts with JESTA and none of them answer. Due to fly soon.",
                "score": 1
            },
            {
                "id": "mgvpdwl",
                "body": "Has anyone successfully booked Cherry blossom boat tour in Kyoto?\n\nAll the tickets are gone in less than 2 minutes, I don't think it's humanely possible to get it done. So all those bookings are done by plugins?\n\nThen I looked into klook, the website offers same activity, but charge 8 times more price per person. That also indirectly confirms my suspicion that all the tickets are taken by plugins then resell by those who want to make profit by impairing other people's experience.",
                "score": 1
            },
            {
                "id": "mgumcvn",
                "body": "Hi I’ll be heading to hirosaki and I heard that in the aomori prefecture, bears are eaten there so I would like to ask for recommendations as to where to go to try bear meat. I’ve tried searching on google but haven’t found any hits.  I would also like to get restaurant recommendations that serve unusual meats like whale and horse. As long as they are in osaka, kyoto, tokyo or hirosaki, all recommendations are welcome.",
                "score": 0
            },
            {
                "id": "mgo8udo",
                "body": "Due to the dumpster-fire that is the US government, I find myself in tokyo with 2 free days before my return trip. I dont know how many people can say that they learned about a vacation only upon stepping off the plane in said country.",
                "score": -2
            },
            {
                "id": "mgww1b2",
                "body": "Japan 2025 Trip Itinerary: Need Opinions and Advice!\n\nHey everyone! I’m planning my Japan 2025 trip for May 4-19, and I’d love some feedback on my itinerary. There’s a lot I want to experience, but I’m still trying to make sure I have a good balance of sightseeing, culture, and relaxation. The plan at least 1 activity and 1 park per day. Below is my plan:\n\nDay 1: 4 May 2025     •    Arrival at Narita Airport (14hrs)     •    Take a taxi to the hotel     •    Explore the nearby streets\n\nDay 2: 5 May 2025     •    Morning: Starbucks in Harajuku     •    8:15 AM: Tokyo morning tour: Asakusa, Meiji Shrine, Tsukiji Fish Market     •    Afternoon: Explore Ueno Park, Sumida Park, and Ushijima Shrine     •    Evening: Tokyo Skytree with pass\n\nDay 3: 6 May 2025     •    Morning: Visit Yanaka (Kayaba Coffee, Tennōji Temple, Yanaka Cemetery, Nezu Shrine)     •    Lunch: Nezu Kamachiku (Michelin Bib Gourmand Udon)     •    Afternoon: Visit Nezu Museum and Ueno Garden     •    Evening: Explore Taito City\n\nDay 4: 7 May 2025     •    Morning: Visit Owl Village Café (Shibuya)     •    Late Morning: Shibuya Crossing and Shibuya Museum of Art     •    Afternoon: Visit Yamatane Museum, Pokémon Center Shibuya     •    Evening: Explore Yoyogi Park and Shinjuku\n\nDay 5: 8 May 2025     •    5 AM: Take Shinkansen to USJ (Universal Studios Japan)     •    All Day: Nintendo World     •    Evening: Return to Tokyo\n\nDay 6: 9 May 2025     •    Morning: Tea Ceremony, Samurai Sword Experience, and Samurai Museum     •    Afternoon: Explore Asakusa     •    Evening: Free time or head to Akihabara\n\nDay 7: 10 May 2025     •    Morning: Visit Yasukuni Jinja, Kokyo Gaien, National Museum of Nature and Science     •    Afternoon: Visit Kitanomaru Park and Zojo-ji Temple     •    Evening: Kyu Shiba Gardens\n\nDay 8: 11 May 2025     •    7:30 AM: Full day Mount Fuji tour     •    Evening: Dinner in Hakone and free time after Fuji\n\nDay 9: 12 May 2025     •    Morning: Inokashira Park Café, visit Ghibli Museum     •    Afternoon: Warner Bros Studio Tour     •    Evening: Nerima Joshi Park\n\nDay 10: 13 May 2025     •    6:00 AM: Take Shinkansen to Kyoto for a day trip     •    Return to Tokyo in the evening\n\nDay 11: 14 May 2025     •    Visit Toyosu Park, TeamLab Planets, Legoland, and Small Worlds     •    Evening: Onsen at Saya no Yodokuro\n\nDay 12: 15 May 2025     •    Morning: Owl Village Café, Yoyogi Park     •    Visit Meiji Shrine, Japan Folk Crafts Museum     •    Optional: Nikko Day Trip\n\nDay 13: 16 May 2025     •    Morning: Visit Tokyo Waterworks Museum, Koishikawa Garden     •    Afternoon: Tokyo Dome, Sumo Show\n\nDay 14: 17 May 2025     •    Visit Yasukuni Jinja and Kitanomaru Garden     •    Afternoon: Sushi Making Experience\n\nDay 15: 18 May 2025     •    Morning: Visit Pokémon Center Mega Tokyo, Akihabara     •    Afternoon: Explore Ikebukuro, Nakano Broadway     •    Evening: Shibuya Sky\n\nDay 16: 19 May 2025     •    Return to Montreal via Narita Airport\n\nA few things I’m debating:     1.    USJ Day: I have a whole day dedicated to USJ (Universal Studios Japan), but I’m wondering if it’s worth the time. Should I swap it for more Tokyo exploration (e.g., Akihabara, Yoyogi, Pokémon Centers)?     2.    Nikko Day Trip: I’m considering adding a day trip to Nikko on May 15, but I’m not sure if I have enough energy. Do you think it’s worth it, or should I relax and explore more of Tokyo instead?\n\nWould love to hear any feedback or suggestions on my schedule, especially if you’ve been to Japan before! Am I missing any must-see spots or experiences? Thanks in advance",
                "score": -4
            },
            {
                "id": "mh55a5v",
                "body": "You will do great, I am going alone in a month as well, at the end of April. \n\nGoogle maps works amazing there and I suck at directions but was able to find my way around. Learn a few phrases. Google translate works great. You got this :)",
                "score": 1
            },
            {
                "id": "mgkxwww",
                "body": "There's no Shinkansen at Shinjuku, but if you were going to that station, the Odakyu Line is the best choice overall and takes you directly to Hakone Yumoto. \n\nIf you go to Shinagawa, the Shinkansen is the faster choice (and basically as expensive as taking the Romance Car). The Shonan Shinjuku line or another local line work too, but those are normal trains that can be quite busy until you're past Yokohama, if you were riding them in the morning.\n\nTaking the JR trains requires transfering at Odawara, so it's also less direct than the Odakyu trains.",
                "score": 4
            },
            {
                "id": "mgm0g1q",
                "body": "Are you thinking of staying outside of Tokyo and commuting into the city each day? As the city is vast, that's probably a false economy as you'll spend a lot of time travelling.\n\nYou could look into Yokohama or areas in western Tokyo along the Chou Line or along other commuter rail lines for places outside of central Tokyo with relatively manageable commutes.",
                "score": 2
            },
            {
                "id": "mgp6bqp",
                "body": "Are you talking about food or lodgings?",
                "score": 1
            },
            {
                "id": "mgpj81s",
                "body": "Are you looking to get one room for 10 people? Or 2-3 rooms? \nTry OMO3 Asakusa",
                "score": 1
            },
            {
                "id": "mgosg46",
                "body": "If you’re interested in climbing Mt. Fuji, it’s available to from July-September usually.",
                "score": 1
            },
            {
                "id": "mgp61dt",
                "body": "You can ride the Hayabusa.",
                "score": 1
            },
            {
                "id": "mgrq744",
                "body": "Haneda. In almost all circumstances, wherever you travel you need to pass through immigration and customs at the first airport in your destination country that you arrive at as you will then transfer to a domestic flight. The only exception can be where your international flight then continues onto another destination in the same country, but this is rare these days.",
                "score": 3
            },
            {
                "id": "mh3stzd",
                "body": "I'd say the second one you can take a quick flight from Hiroshima back to Tokyo then straight home",
                "score": 2
            },
            {
                "id": "mh3t20y",
                "body": "You and me both I've noticed this a lot tickets go up then bang nothing left them look has it for double plus price",
                "score": 0
            },
            {
                "id": "mgy9n95",
                "body": "The main reason that animal cafes exist in Japan is the country's lax animal welfare laws. Animals like owls obviously don't belong in cafes. Don't encourage these horrible businesses.\n\nThis also appears to be an AI itinerary, and has the usual weird features. For instance, doing two day trips from Tokyo to the Kansai region makes no sense and the Tsukiji Fish Market was demolished several years ago (the less interesting outer market remains).",
                "score": 3
            },
            {
                "id": "mgr9tn5",
                "body": "ok so we've been looking today and mostly hostel's are available; however, with the adults being 40-50 do you think that will be an issue? Also we see there is a hotel that is inexpensive and just north of a temple called Senso-ji. It has the wording \"Ladies Priority\". Is that some form of notice that they use the hotel for things we may not want the kids to see?",
                "score": 1
            },
            {
                "id": "mgpfyue",
                "body": "Lodgings mostly but didn't think about food, that will get us too. \n\nLooking at Yokohama currently to try and lower costs",
                "score": 1
            },
            {
                "id": "mgppe1r",
                "body": " 3 couples with kids. 11 total people, I will look at it but don't think we can get 1 room. Just same building if possible.",
                "score": 1
            },
            {
                "id": "mh4xwvf",
                "body": "Thank you so much!",
                "score": 1
            },
            {
                "id": "mgrj80c",
                "body": "I don't know I'm afraid. Lots of Japanese hotels have women-only floors, so the entire hotel could be women only.\n\nI'd suggest looking into business hotel chains like Dormy Inn. The rooms are tiny, but the hotels are good value otherwise. Tokyo is an expensive city to stay in.",
                "score": 1
            },
            {
                "id": "mgs3j2v",
                "body": "Ty will check them after we get home. We've used vrbo here maybe there are vrbo listing or something like it out there too.",
                "score": 1
            }
        ]
    },
    {
        "title": "What are your thoughts for a first timer here in april?",
        "id": "1j8ojjv",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j8ojjv/what_are_your_thoughts_for_a_first_timer_here_in/",
        "score": 1,
        "comments": [
            {
                "id": "mh6oxc6",
                "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "title": "18 Days Itenerary - Help",
        "id": "1j8ml1h",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j8ml1h/18_days_itenerary_help/",
        "score": 1,
        "comments": [
            {
                "id": "mh6a4sr",
                "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "mh6v36o",
                "body": "D2 and D3. Himeji does not require a full day. You'd only need about 3\\~4 hours if you're with a guide (you can search for free volunteer guides for Himeji Castle, but please apply only if you're really interested about its history), probably shorter if you're just checking out the castle on your own (cleared it in 2hrs the first time I went there). I normally combine it with a trip to Miyajima (or Hiroshima) because I might as well just do the Shinkansen trip once, but that may be quite high tempo for you. You can also consider making a quick stop at Kobe, or just go back to Osaka and check out Den Den town earlier, or visit some other places. Make sure you get the Kansai-Hiroshima Pass as it will easily pays itself out.\n\nD5. Osaka castle is going to be disappointing after visiting Himeji Castle.\n\nD7. Onsen in Kyoto? Where? Just curious. Kyoto's not particularly well known for onsen.\n\nD8. Bamboo groves are ok to visit it you manage your expectations. Majority of the tourists crowd the entrance and the short distance after it, so it you walk all the way to the end, it's possible to get good pictures with few people in it. Sagano Scenic Railway on the other hand is a trap in my opinion, and only worth it during sakura season or autumn peaks. Avoid it otherwise.\n\nD9. You don't need a full day at Fushimi Inari Taisha. Go there early (7+ is good for a relatively quiet experience), go as high as you want, then maybe visit Uji after. It's along the same train track.\n\nI'm personally a huge fan of onsen towns, and it's always a highlight of my trip to visit one. You can considering visiting at least one as it serves as a good rest day. There's always the typical Hakone that you can consider, but there are other options like Kinosaki or Arima. Or if you're are more adventurous, you can go to other lesser visited ones.",
                "score": 1
            }
        ]
    },
    {
        "title": "7 Day Itinerary | Need Help",
        "id": "1j8idwo",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j8idwo/7_day_itinerary_need_help/",
        "score": 2,
        "comments": [
            {
                "id": "mh5ey2s",
                "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "mh66274",
                "body": "I am no pro, but 2 shinkansen trips to a similar place - why not travel to kyoto, stay overnight, go to jara then return to tokyo.",
                "score": 2
            },
            {
                "id": "mh6lanf",
                "body": "Traveling from Tokyo to Kyoto and Tokyo to Nara on the 4th and 6th days is expensive. And you can't relax. If you go to Kyoto and Nara, it's better to spend a night in Osaka. But even if you don't go to Kyoto or Nara, you can experience traditional Japanese townscapes and relax if you go to Hakone or Nikko near Tokyo.",
                "score": 2
            },
            {
                "id": "mh6r940",
                "body": "Your itinerary looks exciting but may be quite tiring and expensive. With long travel times between Tokyo, Kyoto, and Nara, as well as packed days with multiple activities, you’ll likely feel rushed and exhausted, especially with trips like the Shinkansen to Kyoto and Nara. Tokyo Disneyland and TeamLab on the same day could be particularly draining. While the plan covers a lot of great places, it’s important to remember that travel costs (especially for Shinkansen) and energy can add up quickly. If you’re looking to keep the pace manageable, you might want to scale back on a few activities.",
                "score": 1
            },
            {
                "id": "mh6t36p",
                "body": "On your second last day, you can stop at one of the hotels near the airport. They have free shuttles that would take you to the airport the next morning, the timings for the shuttle are mentioned at the reception.",
                "score": 1
            },
            {
                "id": "mh6ubtp",
                "body": "This was our itinerary for Winter of 2023, you can pick and choose whatever you like! Hope it helps :)\n\nDay 1: Arrival in Tokyo (November 25)\nArrival and check-in at the hotel. Visit Roppongi Christmas Market\nHotel Name: APA Hotel Roppongi Six\n\nDay 2: Tokyo (November 26)\nDay trip to Nikko. Explore Akihabara in the evening\n\nDay 3: Tokyo - Nikko - Kyoto (November 27)\nKawaguchiko Day Trip, Return to Tokyo in the evening.\n\nDay 4: Tokyo - Kawaguchiko - Tokyo (November 28)\nTeam labs, Shibuya sky and Go karting. Team labs planets at 4pm\nExplore Shibuya and Shinjuku in the evening\n\nDay 5: Tokyo - Kyoto (November 29)\nTokyo to Kyoto by JR Train. Day at leisure.\nVisit Ninenzaka stairs, Kiyomizu-dera temple, and watch light show at Kodaiji temple\nHotel Name: APA Hotel Kyoto-Eki Horikawadori\n\nDay 6: Kyoto (November 30)\nVisit Arashiyama Bamboo forest in the morning. Ride Sagano Romantic Railway and Hozugawa Boat Ride. Visit  Tenryuji temple. Evening at Gion District \n\nDay 7: Kyoto - Nara - Osaka - Kyoto (December 1)\nVisit Nara in the morning, Travel to Osaka after lunch.\nExplore Dotonbori and try local street food. Return to Tokyo and return to Kyoto.\n\nDay 8: Kyoto - Tokyo (December 2)\nVisit Fushimi Inari in the morning, and return to Tokyo by evening.\nHotel Name: Toyoko Inn Narita Airport Shinkan\n\nDay 9: Departure from Tokyo (December 3)\n\nI also visited Hokkaido for a week. Let me know if you want that itinerary as well!",
                "score": 1
            },
            {
                "id": "mh6ve9h",
                "body": "I'd do an overnight in Kyoto and combine that with Nara. You can go to Fushimi Inari super early in the morning on the way to Nara ",
                "score": 1
            }
        ]
    }
]