[
    {
        "title": "Weekly Japan Travel Information and Discussion Thread - February 07, 2025",
        "id": "1ijug04",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1ijug04/weekly_japan_travel_information_and_discussion/",
        "score": 12,
        "comments": [
            {
                "id": "mbomop8",
                "body": "Traveling to Kamakura from Tokyo next week.  Can anyone recommend the best way to get to Yokohama chinatown on my way back to Tokyo?   I did this last year and the taxi ride seemed too long from whatever station in Yokohama I arrived in from Kamakura which google maps recommended.",
                "score": 1
            },
            {
                "id": "mbr1lyf",
                "body": "Heading to Japan in May, I've got a rough idea of what I am doing but need some help with accommodation recommendations, I'm going solo so I don't need a lot but I don't want to stay at hostels or capsule places.\n\nArrive Narita Airport 8:30pm 17th May - Stay one night at a nearby hotel (haven't decided where yet I can't figure out which places have 24 hour check in)\n\nSunday 18th - Take shinkansen straight to Kyoto, Stay in Kyoto from 18th till  22nd (need an idea of a cheapish place to stay, I was looking at Airbnbs, Lots of traditional places?)\n\n22nd Back to Tokyo on the Shinkansen, Stay in Asakusa from the 22nd till I leave on the 31st.\n\nI want to do it this way as one of the big things I plan to do is shop for retro gaming stuff / anime stuff etc and not having to lug purchases to Kyoto and back sounds like a good idea.\n\nOther then that my plans are pretty open, I have no interest in big theme parks like Disney and will probably stay away from any expensive tourist trap or \"experiences\". \n\n  \nSo a few questions I have -\n\nIs there a cheapish hotel in Narita that has 24 hour check in?\n\nWhere should I stay in Kyoto?\n\nShould I take a couple of days to see Osaka? Or should  I stop and stay somewhere small between Kyoto and Tokyo?\n\nIs Asakusa a good place to stay in Tokyo, I don't mind a bit of travel and would prefer a bit quieter if there is a further out option.\n\n  \nThanks Tomadachis!",
                "score": 1
            },
            {
                "id": "mbn6l0c",
                "body": "Anybody know a sushi restaurant in osaka or tokyo that serves fresh wasabi and doesn't require reservations?",
                "score": 0
            },
            {
                "id": "mbpqzti",
                "body": "Just found out about the 'Kansai Railway Pass' and long story short it would be perfect for my group, normal JR pass isn't for us at all. \n\nThe problem is, we're going in June and the pass promo is only until May, are there any alternatives? It's hard to search for it blindly when it probably has some special name. I've found the 'Kansai Area Pass' on JR official site but I'm quite confused because the site attempts to use professional english but it's poorly translated, so I'm not sure if it's something we can just buy and use",
                "score": 0
            },
            {
                "id": "mbspdys",
                "body": "my friend (25F) and I (25F) are booking for 24 Dec 2025 - 7 Jan 2026, we are looking for some hiking/trekking preferably near tokyo or any major cities. it should ideally be accessible by public transport as we're not renting a car. we're not avid hikers and don't really have snow gear so an easy one would do. hoping to see a bit of snow but not thick snow as we have almost zero snow experience. any suggestions?",
                "score": 0
            },
            {
                "id": "mbzc7ln",
                "body": "Hi I'm looking for help from any Singaporeans or anyone coming back to Singapore in Hokkaido, Sapporo at the time of writing this, with a purchase that I would like to get back from the exact stall at the Sapporo Snow Festival cos we lost the thing we bought, help would be much appreciated thank you",
                "score": 0
            },
            {
                "id": "mbzwznw",
                "body": "Kanazawa weather?\n\nWe are heading to the western part of Japan mainly Kanazawa but using the JR Hokuriku Area Pass to go to other areas (Fukui, Toyama, Obama). Heading there at this time of year since we heard there’s some snow but saw the forecast as mostly rain…\n\nJust wanted to see what the weather is like this time of year to prepare clothing! The temperature of our current location (Korea) is colder but with potential snow I want to know how to dress. We are bringing heat tech and will probably buy more. Is it currently as cold as we are expecting?",
                "score": 0
            },
            {
                "id": "mbs0o6n",
                "body": "Just go to Ishikawacho Station and walk from there.",
                "score": 2
            },
            {
                "id": "mbsa88l",
                "body": "There are a few different connection options depending where you start in Kamakura. Use Google Maps from your location in Kamakura to \"Motomachi-Chuukagai Station.\"",
                "score": 1
            },
            {
                "id": "mbp0pvu",
                "body": "In Japan quality is expected and generally delivered. In Tokyo alone there are 137,,000 restaurants overall. I've rarely been to one that required reservations. Walk around and try places. Ask at your hotel. (yet another reason to skip Airbnbs when traveling)",
                "score": 1
            },
            {
                "id": "mbq2jff",
                "body": "https://www.japan-guide.com/e/e2357_kansai.html",
                "score": 2
            },
            {
                "id": "mbr3l62",
                "body": "Damn, great one, thanks",
                "score": 2
            }
        ]
    }
]