[
    {
        "title": "Weekly Japan Travel Information and Discussion Thread - February 14, 2025",
        "id": "1ipa23o",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1ipa23o/weekly_japan_travel_information_and_discussion/",
        "score": 3,
        "comments": [
            {
                "id": "mcqgj7e",
                "body": "Hey all,\n\nI'm in Tokyo for the next few months and I'll have plenty of time to go to both TeamLabs exhibitions. I've been to PLANETS in the past, but I'm wondering if it's worth a repeat visit with the expansion. Anyone been to the before / after and have an opinion on this?\n\nThanks!",
                "score": 3
            },
            {
                "id": "mcsvqlf",
                "body": "**Kyushu Trip Itinerary – Looking for Feedback!**\n\nHey everyone, I’m planning a trip to Japan in late April–May and would love some feedback on the Kyushu portion. I’ve been to Tokyo and Kyoto before, so I haven’t fully planned those yet, but I wanted to get this part locked in first.\n\nI like a mix of nature, history, and unique local experiences. I also prefer traveling by public transport and won’t be renting a car. Would love any advice on whether this plan makes sense, if I should tweak the pacing, or if there are any hidden gems I shouldn’t miss!\n\n# Kyushu Itinerary\n\n**April 23 (Tue) – Travel Day**\n\n* Flying into Tokyo and heading straight to Kagoshima in the evening. Just a transit stop before heading to Yakushima.\n\n**April 24 (Wed) – Yakushima**\n\n* Taking the first ferry to Yakushima, dropping off my stuff, and starting to explore.\n\n**April 25–27 (Thu–Sat) – Yakushima**\n\n* Three full days on the island for hiking, nature, and exploring. Planning to leave on the last ferry on the 27th to head to Kumamoto.\n\n**April 28–29 (Sun–Mon) – Kumamoto**\n\n* Two days to explore Kumamoto. Might take a day trip somewhere nearby—still deciding.\n\n**April 30 (Tue) – Arita**\n\n* Heading to Arita for the annual pottery fair. Staying overnight.\n\n**May 1–3 (Wed–Fri) – Nagasaki**\n\n* Three days in Nagasaki, with at least one day trip (maybe Gunkanjima or Shimabara).\n\n**May 4–5 (Sat–Sun) – Yamaguchi**\n\n* Planning a day trip to Hagi and another TBD day around Yamaguchi.\n\n**May 6–8 (Mon–Wed) – Fukuyama / Okayama Area**\n\n* Still figuring out specifics, but thinking about places like Onomichi or Kurashiki.\n\nAfter this, I’ll be heading to Kyoto and Tokyo before flying home.\n\nDoes this look like a solid plan? Anything I should change or add? Appreciate any tips!",
                "score": 2
            },
            {
                "id": "mcrg8ws",
                "body": "How realistic is able to walk around the onsens near the Shin-hotaka Ropeway and hike around Takayama in general in the middle of May?",
                "score": 1
            },
            {
                "id": "mcx3sn4",
                "body": "Anyone do self-transfer flights? Tickets from Seattle / Boise are half the cost from my current city (despite being a major airport...). Unsure how cost and time effective it would be to fly into seattle and spend the night before the flight, to give ample time, however I have friends in Boise where I wouldn't need a hotel, but Boise isn't a nonstop flight like Seattle.\n\nWondering if anyone has tried same day. Costs to fly out of my own city are more than double, over $1,000 - so it feels like a good deal",
                "score": 1
            },
            {
                "id": "mcx473k",
                "body": "I’ll be in Tokyo Feb 27 - March 2 ahead of some work travel. I’m hoping to see some snow and trying to figure out a good 1-2 night trip to do so. Yudanaka or Shibu onsen look promising, especially with the monkeys. I’m curious about:\n\n1. Other good options to consider? Ideally within ~3 hours train, and a little more to do than *just* hang around the ryokan\n2. Any advice for finding ryokan that take solo travelers?",
                "score": 1
            },
            {
                "id": "md0f7i0",
                "body": "Hi I'll be going to Yuzawa in early March to experience snow for the first time in my life. Currently have one night accoms booked but can still be cancelled. I just have some questions that I would really appreciate some answers for:\n\n1. Is GALA Yuzawa the best place to go for someone who doesn't plan to ski/snowboard? Or would another resort be better? I've also seen Yuzawa Kogen and NASPA Ski Garden as alternatives but GALA Yuzawa seemed to be more popular, even among non-ski goers online\n2. Are there other activities to do besides the ski resorts in Yuzawa? I'm aware of the Sake Museum at Echigo-Yuzawa station and have plans to do this as well during the day, possibly in the afternoon\n3. Has anyone experienced Sake Bath Yunosawa and was it good? I have tattoos so I can't go to most public baths/onsens (my currently booked accoms has private onsen reservations -- it's why I decided to book one night there). But, if the experience at Sake Bath Yunosawa is good, then I will really reconsider my one night stay\n4. After my initial research, I saw that Karuizawa was another place that's recommended for a day-trip snow experience. Does it make for a better day trip than Yuzawa (in relation to not doing any skiing/snowboarding activities)?\n\nThanks so much in advance!",
                "score": 1
            },
            {
                "id": "md1hg78",
                "body": "Has anyone bought prescription glasses in Japan? I have seen a few IG posts coming by and wondered at people's experience. Thanks.",
                "score": 1
            },
            {
                "id": "md2036u",
                "body": "As someone who lives/works in the UK and holds a Malaysian passport, which home address do I put in VJW? I'll be flying from the UK too.",
                "score": 1
            },
            {
                "id": "md20b1m",
                "body": "Has anyone done the \"**Mobile Suica APK**\" thing to get around Android limitations for the Suica? Is it safe/working? Thanks",
                "score": 1
            },
            {
                "id": "mcucuc4",
                "body": "It seems a shame to not spend any time in Fukuoka, which is an interesting city. I found Kumamoto to be dull.",
                "score": 2
            },
            {
                "id": "md1kt2i",
                "body": "Yes. Search r/JapanTravelTips the topic has been discussed multiple times there.",
                "score": 2
            }
        ]
    },
    {
        "title": "Itinerary check, plus is Ito worth it?",
        "id": "1iqp6jv",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1iqp6jv/itinerary_check_plus_is_ito_worth_it/",
        "score": 2,
        "comments": [
            {
                "id": "md1vfoj",
                "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "md2fb26",
                "body": "I don't think it is too much moving around for a two-week trip, but people have different preferences about that kind of thing.  Personally, I am ok with shorter stays in order to see and do more, but plenty of people feel just the opposite.\n\nThe only thing I would add for Tokyo is a visit to Meiji Jingu shrine, which is easy to get to and right near Harajuku.  I have been many times, but still go again most of the time when I visit Tokyo because the grounds are quite beautiful.\n\nIf you feel that you have been moving around too much and don't want to be moving your stuff from hotel to hotel (or airbnb to airbnb) after Osaka/Kyoto/Nara, then I would do day trips from Tokyo on the back end rather than another location in Japan so you can avoid moving your luggage again.  For example, Karuizawa in Nagano is easily accessible, and even Nikko is a possible day trip, although a longer one.  I like having a few days in Tokyo at the back end of a Japan trip, especially if there are things I want to buy and bring back but don't want to lug around Japan, so if there are day trips that seem interesting to you, I would go for 3 or 4 days in Tokyo on the back end also.\n\nNot sure how you are getting from place to place.  I tend to agree with the camp that feels the all-encompassing JR pass is no longer worth it for most trips now that the price went up a lot, and while I have not priced out your particular itinerary, my sense is that it isn't better than buying individual tickets in your case either.  But if you do go with day trips from Tokyo on the back end of your trip, you might consider the JR Tokyo Wide Pass.  It is 15,000 yen, lasts for 3 days, and will get you to both Karuizawa and Nikko, as well as JR within Tokyo including to both Haneda and Narita (for Narita this is a real benefit, because I think it can be used on Narita Express, but for Haneda, which you are using, it is not a big deal because it is cheap to get to Haneda).  I have used that pass several times (although before it also went up in price).",
                "score": 1
            }
        ]
    }
]