[
    {
        "title": "Weekly Japan Travel Information and Discussion Thread - March 07, 2025",
        "id": "1j5se26",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j5se26/weekly_japan_travel_information_and_discussion/",
        "score": 9,
        "comments": [
            {
                "id": "mgpbsm7",
                "body": "We will be staying at Hotel Toranomon Hills. Easier to take the limo bus to the andaz and walk  or take the Narita Express to Tokyo Station and grab a taxi? We will arrive at 4:30pm on a Thursday.",
                "score": 2
            },
            {
                "id": "mh4romq",
                "body": "I'm going alone to Tokyo and Kyoto in a month, I'm a 30yo man and I'm starting to freak out about it, like what if I get lost, or something happens to me, please reassure me :(",
                "score": 2
            },
            {
                "id": "mgkvchv",
                "body": "Will be staying in Hyatt House Shibuya, whats the best way to get to Hakone? Is it better to:\n\n- Go to Shinagawa, take Shinkansen or Shonan-Shinjuku line?\n- Go to Shinjuku, take Shinkensen or Romancecar?\n\nWill not be getting round trip for Hakone pass.",
                "score": 1
            },
            {
                "id": "mgkxl0u",
                "body": "considering going to tokyo with 5 other adults and 5 total kids. Is there a inexpensive place around/in tokyo that we could all get reservations at? ages are between 40-50 for the adults and 13-18 for the kids.",
                "score": 1
            },
            {
                "id": "mgmul2k",
                "body": "Thinking of planning a trip from Tampa to Tokyo in June since it's around my birthday (hitting the big 30). This would also be my first time leaving the country as an adult and I'm starting the passport process this Monday. Is there anything I should know about Japan climate-wise around that time of year? I hear it can get very humid/hot, even compared to Florida's summers.\n\nI've watched and read plenty of travel tips over the years for Japan specifically, but that's obviously not gonna give the whole picture. Anyone have tips for a solo first-timer? Besides the obvious staying out of trouble, don't be rude, etc. And if anyone has any tips on saving on plane tickets (the prices don't seem to budge much when traveling from east coast, but worth asking), lemee know!",
                "score": 1
            },
            {
                "id": "mgosbe2",
                "body": "Am I able to ride the Hayabusa with no extra charges with a JR East South Hokkaido pass? Or am I only able to do that with a regular JR Pass?",
                "score": 1
            },
            {
                "id": "mgqnqne",
                "body": "Where do I go through customs? I'm flying from the USA to Haneda, and then after Haneda, I have a flight transfer to Hokkaido (Memanbetsu), which is my final stop. Am going to go through customs in Haneda or in Hokkaido?",
                "score": 1
            },
            {
                "id": "mh14pkn",
                "body": "Anyone have experience with expedited medication approval? Only found out about it a couple days ago and I'm leaving this Thursday. Tried to send in the documents and they replied that it was too soon, but I've seen others say they can get it done as quick as 24 hours and that I should press them on it? It's just vyvanse so nothing crazy. Could just throw it in my bag and I figure they won't go that hard scrutinizing",
                "score": 1
            },
            {
                "id": "mh15r3f",
                "body": "For a trip that starts/ends in Tokyo, where would you fit in Hiroshima? I do not want to go to Hiroshima upon landing or the next day. We are planning 5 nights in Tokyo upon arrival, then will go to either Kyoto or Hiroshima. But which? And, yes, skipping Osaka…\n\nTokyo -> Hiroshima -> Kyoto -> Tokyo\n\n\nTokyo -> Kyoto -> Hiroshima -> Tokyo",
                "score": 1
            },
            {
                "id": "mh3sngm",
                "body": "Well I fucked up and didn't get on early enough and missed out the pass I wanted for USJ time to line up in the single person line and pray for the best",
                "score": 1
            },
            {
                "id": "mh6jrk4",
                "body": "JESTA question (possibly another, sorry). I’m from one of the 71 visa exempt countries and believe everything is still fine. I have seen the news about JESTA coming in to force in 2030 but now see 2025 being mentioned. Do I need to get a visa before travelling, or sort JESTA out now, or am I still good. I have used the search bar at the top but only see two posts with JESTA and none of them answer. Due to fly soon.",
                "score": 1
            },
            {
                "id": "mgvpdwl",
                "body": "Has anyone successfully booked Cherry blossom boat tour in Kyoto?\n\nAll the tickets are gone in less than 2 minutes, I don't think it's humanely possible to get it done. So all those bookings are done by plugins?\n\nThen I looked into klook, the website offers same activity, but charge 8 times more price per person. That also indirectly confirms my suspicion that all the tickets are taken by plugins then resell by those who want to make profit by impairing other people's experience.",
                "score": 1
            },
            {
                "id": "mgumcvn",
                "body": "Hi I’ll be heading to hirosaki and I heard that in the aomori prefecture, bears are eaten there so I would like to ask for recommendations as to where to go to try bear meat. I’ve tried searching on google but haven’t found any hits.  I would also like to get restaurant recommendations that serve unusual meats like whale and horse. As long as they are in osaka, kyoto, tokyo or hirosaki, all recommendations are welcome.",
                "score": 0
            },
            {
                "id": "mgo8udo",
                "body": "Due to the dumpster-fire that is the US government, I find myself in tokyo with 2 free days before my return trip. I dont know how many people can say that they learned about a vacation only upon stepping off the plane in said country.",
                "score": -2
            },
            {
                "id": "mgww1b2",
                "body": "Japan 2025 Trip Itinerary: Need Opinions and Advice!\n\nHey everyone! I’m planning my Japan 2025 trip for May 4-19, and I’d love some feedback on my itinerary. There’s a lot I want to experience, but I’m still trying to make sure I have a good balance of sightseeing, culture, and relaxation. The plan at least 1 activity and 1 park per day. Below is my plan:\n\nDay 1: 4 May 2025     •    Arrival at Narita Airport (14hrs)     •    Take a taxi to the hotel     •    Explore the nearby streets\n\nDay 2: 5 May 2025     •    Morning: Starbucks in Harajuku     •    8:15 AM: Tokyo morning tour: Asakusa, Meiji Shrine, Tsukiji Fish Market     •    Afternoon: Explore Ueno Park, Sumida Park, and Ushijima Shrine     •    Evening: Tokyo Skytree with pass\n\nDay 3: 6 May 2025     •    Morning: Visit Yanaka (Kayaba Coffee, Tennōji Temple, Yanaka Cemetery, Nezu Shrine)     •    Lunch: Nezu Kamachiku (Michelin Bib Gourmand Udon)     •    Afternoon: Visit Nezu Museum and Ueno Garden     •    Evening: Explore Taito City\n\nDay 4: 7 May 2025     •    Morning: Visit Owl Village Café (Shibuya)     •    Late Morning: Shibuya Crossing and Shibuya Museum of Art     •    Afternoon: Visit Yamatane Museum, Pokémon Center Shibuya     •    Evening: Explore Yoyogi Park and Shinjuku\n\nDay 5: 8 May 2025     •    5 AM: Take Shinkansen to USJ (Universal Studios Japan)     •    All Day: Nintendo World     •    Evening: Return to Tokyo\n\nDay 6: 9 May 2025     •    Morning: Tea Ceremony, Samurai Sword Experience, and Samurai Museum     •    Afternoon: Explore Asakusa     •    Evening: Free time or head to Akihabara\n\nDay 7: 10 May 2025     •    Morning: Visit Yasukuni Jinja, Kokyo Gaien, National Museum of Nature and Science     •    Afternoon: Visit Kitanomaru Park and Zojo-ji Temple     •    Evening: Kyu Shiba Gardens\n\nDay 8: 11 May 2025     •    7:30 AM: Full day Mount Fuji tour     •    Evening: Dinner in Hakone and free time after Fuji\n\nDay 9: 12 May 2025     •    Morning: Inokashira Park Café, visit Ghibli Museum     •    Afternoon: Warner Bros Studio Tour     •    Evening: Nerima Joshi Park\n\nDay 10: 13 May 2025     •    6:00 AM: Take Shinkansen to Kyoto for a day trip     •    Return to Tokyo in the evening\n\nDay 11: 14 May 2025     •    Visit Toyosu Park, TeamLab Planets, Legoland, and Small Worlds     •    Evening: Onsen at Saya no Yodokuro\n\nDay 12: 15 May 2025     •    Morning: Owl Village Café, Yoyogi Park     •    Visit Meiji Shrine, Japan Folk Crafts Museum     •    Optional: Nikko Day Trip\n\nDay 13: 16 May 2025     •    Morning: Visit Tokyo Waterworks Museum, Koishikawa Garden     •    Afternoon: Tokyo Dome, Sumo Show\n\nDay 14: 17 May 2025     •    Visit Yasukuni Jinja and Kitanomaru Garden     •    Afternoon: Sushi Making Experience\n\nDay 15: 18 May 2025     •    Morning: Visit Pokémon Center Mega Tokyo, Akihabara     •    Afternoon: Explore Ikebukuro, Nakano Broadway     •    Evening: Shibuya Sky\n\nDay 16: 19 May 2025     •    Return to Montreal via Narita Airport\n\nA few things I’m debating:     1.    USJ Day: I have a whole day dedicated to USJ (Universal Studios Japan), but I’m wondering if it’s worth the time. Should I swap it for more Tokyo exploration (e.g., Akihabara, Yoyogi, Pokémon Centers)?     2.    Nikko Day Trip: I’m considering adding a day trip to Nikko on May 15, but I’m not sure if I have enough energy. Do you think it’s worth it, or should I relax and explore more of Tokyo instead?\n\nWould love to hear any feedback or suggestions on my schedule, especially if you’ve been to Japan before! Am I missing any must-see spots or experiences? Thanks in advance",
                "score": -4
            },
            {
                "id": "mh55a5v",
                "body": "You will do great, I am going alone in a month as well, at the end of April. \n\nGoogle maps works amazing there and I suck at directions but was able to find my way around. Learn a few phrases. Google translate works great. You got this :)",
                "score": 1
            },
            {
                "id": "mgkxwww",
                "body": "There's no Shinkansen at Shinjuku, but if you were going to that station, the Odakyu Line is the best choice overall and takes you directly to Hakone Yumoto. \n\nIf you go to Shinagawa, the Shinkansen is the faster choice (and basically as expensive as taking the Romance Car). The Shonan Shinjuku line or another local line work too, but those are normal trains that can be quite busy until you're past Yokohama, if you were riding them in the morning.\n\nTaking the JR trains requires transfering at Odawara, so it's also less direct than the Odakyu trains.",
                "score": 4
            },
            {
                "id": "mgm0g1q",
                "body": "Are you thinking of staying outside of Tokyo and commuting into the city each day? As the city is vast, that's probably a false economy as you'll spend a lot of time travelling.\n\nYou could look into Yokohama or areas in western Tokyo along the Chou Line or along other commuter rail lines for places outside of central Tokyo with relatively manageable commutes.",
                "score": 2
            },
            {
                "id": "mgp6bqp",
                "body": "Are you talking about food or lodgings?",
                "score": 1
            },
            {
                "id": "mgpj81s",
                "body": "Are you looking to get one room for 10 people? Or 2-3 rooms? \nTry OMO3 Asakusa",
                "score": 1
            },
            {
                "id": "mgosg46",
                "body": "If you’re interested in climbing Mt. Fuji, it’s available to from July-September usually.",
                "score": 1
            },
            {
                "id": "mgp61dt",
                "body": "You can ride the Hayabusa.",
                "score": 1
            },
            {
                "id": "mgrq744",
                "body": "Haneda. In almost all circumstances, wherever you travel you need to pass through immigration and customs at the first airport in your destination country that you arrive at as you will then transfer to a domestic flight. The only exception can be where your international flight then continues onto another destination in the same country, but this is rare these days.",
                "score": 5
            },
            {
                "id": "mh3stzd",
                "body": "I'd say the second one you can take a quick flight from Hiroshima back to Tokyo then straight home",
                "score": 2
            },
            {
                "id": "mh3t20y",
                "body": "You and me both I've noticed this a lot tickets go up then bang nothing left them look has it for double plus price",
                "score": 0
            },
            {
                "id": "mgy9n95",
                "body": "The main reason that animal cafes exist in Japan is the country's lax animal welfare laws. Animals like owls obviously don't belong in cafes. Don't encourage these horrible businesses.\n\nThis also appears to be an AI itinerary, and has the usual weird features. For instance, doing two day trips from Tokyo to the Kansai region makes no sense and the Tsukiji Fish Market was demolished several years ago (the less interesting outer market remains).",
                "score": 3
            },
            {
                "id": "mgr9tn5",
                "body": "ok so we've been looking today and mostly hostel's are available; however, with the adults being 40-50 do you think that will be an issue? Also we see there is a hotel that is inexpensive and just north of a temple called Senso-ji. It has the wording \"Ladies Priority\". Is that some form of notice that they use the hotel for things we may not want the kids to see?",
                "score": 1
            },
            {
                "id": "mgpfyue",
                "body": "Lodgings mostly but didn't think about food, that will get us too. \n\nLooking at Yokohama currently to try and lower costs",
                "score": 1
            },
            {
                "id": "mgppe1r",
                "body": " 3 couples with kids. 11 total people, I will look at it but don't think we can get 1 room. Just same building if possible.",
                "score": 1
            },
            {
                "id": "mh4xwvf",
                "body": "Thank you so much!",
                "score": 1
            },
            {
                "id": "mgrj80c",
                "body": "I don't know I'm afraid. Lots of Japanese hotels have women-only floors, so the entire hotel could be women only.\n\nI'd suggest looking into business hotel chains like Dormy Inn. The rooms are tiny, but the hotels are good value otherwise. Tokyo is an expensive city to stay in.",
                "score": 1
            },
            {
                "id": "mgs3j2v",
                "body": "Ty will check them after we get home. We've used vrbo here maybe there are vrbo listing or something like it out there too.",
                "score": 1
            }
        ]
    },
    {
        "title": "Monthly Meetup Thread - March",
        "id": "1ixh54t",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1ixh54t/monthly_meetup_thread_march/",
        "score": 11,
        "comments": [
            {
                "id": "memw0m3",
                "body": "Hi I'm 29 F solo from the US! Hoping to see cherry blossoms on this trip \n\nI'll be traveling to\n\n(3/21-3/25) Tokyo\n\n(3/25-3/31) Kyoto/Osaka\n\n(3/31-4/3) Hiroshima/Miyajima + Rabbit Island \n\n(4/3-4/7) Various cities in Kyushu region\n\nI would love to get a meal together, take walks, etc!",
                "score": 5
            },
            {
                "id": "mf4rg2m",
                "body": "hi 31F here from las vegas!\nheading to tokyo from March 10-16th. english speaking.\nI have no real itinerary as it is my 4th time visiting so I just plan to shop, eat, and explore!!\nnot really going solo as my mom and sister wanted to go but they will be out doing random touristy stuff while I go off on my own lol but was hoping to meet some other solo ppl and hang out!\nlover of cute things, matcha, food, dogs, anime, arcades and pretty much anything 🥺 base will be shibuya",
                "score": 4
            },
            {
                "id": "memo24s",
                "body": "I love the idea of this! If i wasnt going in a large group that I've done all the planning for, I'd totally be down for this. Maybe next time I get to do a trip since i want to do like a 30 day solo trip next time.",
                "score": 3
            },
            {
                "id": "mex12xb",
                "body": "Hey everyone, I'm a 21F from NY solo traveling to Japan for the first time. I'll be in Tokyo from 18th to 21st, going to Kyoto and then back to Tokyo from 24th to 26th. Let me know if anyone wants to meet up and I'll share my itinerary! down for pretty much anything, but I love shopping, going out, and nature. :)",
                "score": 3
            },
            {
                "id": "mexirrf",
                "body": "Hi ! I'm 26M solo from France :) This is my first trip to Japan, and I'm by myself. Looking for people to visit museums/shrines with, grab food with, or have a couple of drinks/experience the nightlife a bit !\n\nI'll be in :\n\nTokyo 3/2\\~3/10  \nKyoto 3/10\\~3/14  \nOsaka 3/14\\~3/18  \nTokyo 3/18\\~3/21\n\nFeel free to shoot me a DM ! Fluent in French & English",
                "score": 3
            },
            {
                "id": "memzeho",
                "body": "Hi I’m 39M traveling from the US! First time in Japan.\n\nI’ll be in:\n\nTokyo 3/11 - 3/14\n\nOsaka 3/14 - 3/21\n\nTokyo 3/21 - 3/25\n\nWith day trips to Kamakura, Kyoto, Nara and Hiroshima.\nI’d love to grab drinks, walk around, or really anything!",
                "score": 2
            },
            {
                "id": "meyt8ji",
                "body": "28 (F) travelling solo from Vancouver Canada. \nTokyo: March 7-13; 15-18\nOsaka: March 13-15\nAnyone want to grab meal together in Osaka? I don’t have plans in Osaka lol. Maybe visit the castle and stroll around Dotonbori. \nAlso, does anyone have spare Ghibli Museum ticket?",
                "score": 2
            },
            {
                "id": "mfe4xht",
                "body": "19M otaku from Singapore, first time in Japan because of hololive expo and sightseeing, if I can somehow accidentally stumble upon someone who I can meetup with that would definitely make my family members worry less about me travelling alone. I could also use an extra hand in taking photos (might cosplay)\n\nForgive my rushed and stupid itineary \n7 to 10th March in Tokyo\n11th March Shiroishi/Sendai\n12-13th March Sendai\n14th March Morioka\n15-17th March Tokyo again\n\nI speak English and Chinese and whatever Japanese my 330 day streak on Duolingo has gotten me.",
                "score": 2
            },
            {
                "id": "mfri0om",
                "body": "Hiya! I'm F23 from Finland, on my second trip to Japan. I'll be in Tokyo until march 13th. I was planning to do day trips to Saitama, Izu peninsula, Ibaraki and possibly Nikkō if the weather is good. Haven't planned any specific dates yet though. I like nature, history, beauty, fashion, thrifting and generally seeing sights but I'm totally open for trying out new things too! I speak Finnish and English well, but my Japanese is only about N5 level",
                "score": 2
            },
            {
                "id": "meoa2qu",
                "body": "34M/32F, American husband and wife living in LA going to Japan for the first time! Eagerly practicing Japanese and we’re both super interested in food, uniquely Japanese culture in both city and country, food, history, meeting cool people both local and visitors, and FOOD!\n\nTokyo 3/18→23\n\nKyoto 3/23→26\n\nShikoku 3/26→30\n\nHiroshima 3/30→4/1\n\nLet us know if you have any overlap :)",
                "score": 1
            },
            {
                "id": "mepcl0w",
                "body": "Hi 30 F here - i'll be traveling solo to Japan for the 2nd time and will be staying for 15 days. Homebase will be the following \n\n3/16\\~3/21 - Osaka  \n\\> Will have day trips to Himeji, Hiroshima and Kyoto. I'm also planning on availing the Osaka Amazing Pass.\n\n3/21\\~3/29 - Tokyo  \n\\> Already have plans for 22-24 but i'm planning to visit Yokohama on 25th for the Cup Noodles Museum and Kirin Brewery.\n\nWould be nice to meet fellow travelers :)",
                "score": 1
            },
            {
                "id": "mepff6i",
                "body": "I just arrived to Japan today from the US to celebrate my birthday. 32 M in Tokyo until the 28th then I plan to go to Kyoto until the 4th and return to Tokyo until departing on the 6th. If anyone is around and wants to meet up, feel free to leave me a message.",
                "score": 1
            },
            {
                "id": "mernf0i",
                "body": "Hi! I have one (possibly two) tickets to the Studio Ghibli museum for March 13th, unfortunately two members of our group won't be going to this so if anyone is interested please let me know!",
                "score": 1
            },
            {
                "id": "metf94n",
                "body": "Hey guys - 23M from the UK, first ever solo trip!\n\n\nI’ll be in:\n\nTokyo 3/5 - 3/9\n\nKyoto 3/9 - 3/12\n\nHiroshima 3/12 - 3/15\n\nTokyo 3/15 - 3/17\n\nCurrently have no pre-booked plans but am definitely planning on checking music bars in Tokyo and its general nightlife, visiting Temples in Kyoto and the A-Bomb Museum in Hiroshima.\n\nLet me know if anyone has an overlap!!",
                "score": 1
            },
            {
                "id": "meuakv2",
                "body": "Hi I am Blake!\n\n* Doing a trip with my partner and family but will list the dates where I am staying an extra few days to experience Japan solo.\n* I'll be in Tokyo: 03/27-04/03\n* I am a 30 year old male\n* United States - Speak English and very basic Japanese\n* I am a retired racing driver, I love reading, gunpla, and many other things.\n* I would love to meet up, get a meal, and explore the city with others!\n\nI am really open to anything, I think it'd be cool to meet some new people and experience Japan together!\n\nFeel free to DM me here!",
                "score": 1
            },
            {
                "id": "meveckp",
                "body": "Hey r/JapanTravel! Solo 39F currently on first trip in Japan. It’s such a great experience and I’m excited for all of the travelers soon to be here! Anyway, I’m in Tokyo now but I leave for Hakone tomorrow. I’ll be traveling the following cities/dates if anyone is around and wants to meet up for some sightseeing/food/adventures:\n\n2/27-3/1: Hakone\n\n3/1 - 3/3: Kyoto\n\n3/3 - 3/5: Hiroshima/Miyajima\n\n3/5 - 3/7: Osaka",
                "score": 1
            },
            {
                "id": "mexwjnu",
                "body": "Hi, I'm 22F from US! This is my first time traveling to Japan. I have a solo day in Tokyo on March 23, Sunday. \nI'm very interested in photography, museums, food, and the bars in Tokyo. Feel free to DM me if you want to meet up and shoot, or go grab dinner and a drink later in the day!",
                "score": 1
            },
            {
                "id": "meziu78",
                "body": "Hey! 33M from the US, I will be traveling solo for the 5th time in Japan. I’ve traveled all over between Hokkaido and Kyushu, so this time my focus will be cherry blossom viewing and my dates for each city are TBD/flexible.\n\n3/19 -  3/25 Tokyo\n\n3/25 - 3/30 Osaka / Kyoto \n\n3/30 - 4/8 Tokyo / TBD\n\nI’m pretty familiar with Japan at this point. I enjoy coffee, museums, photography, hiking, parks, and trying new foods.",
                "score": 1
            },
            {
                "id": "mf10txf",
                "body": "Hi! 35F from the US visiting Japan for first time. Things I like coffee, food, Dodgers baseball, and street art. Planning to do a ton of walking.\n\nI'll be traveling to\n\nKyoto 3/11-3/14 -- planning to a nice dinner, visiting a matcha farm and otherwise wandering around\n\nOsaka 3/14-3/16 - food tour and hopefully visiting Nara for a day trip\n\nTokyo 3/16-3/21 - Touring the Japanese National Stadium, eating some sushi, trying to catch the dodgers on TV at a bar somewhere, and a hit list of neighborhoods for just walking",
                "score": 1
            },
            {
                "id": "mf3o5d0",
                "body": "Hi, 62 YO Male, traveling solo to Japan to check out Sakura blossoms. Hope it's not too early!!! But I am also interested in  live music scene, esp. Japanese classical music, theater, and museums. Temples of course. \n\nIn Tokyo 3/1-5 (one day a day trip to Hakone to see Mt. Fuji)\n\nIn Kyoto 3/5-10\n\nIn Nagoya 3/10-11\n\nBack to US on 11\n\nIf you are in town and would like to join one of the days to an event DM me.",
                "score": 1
            },
            {
                "id": "mf43x3j",
                "body": "Hello there! 27M from Canada travelling to Japan at the end of March, second time visiting but first time solo travelling.  \n  \nMy Itinerary is as follows:\n\nMarch 26th to March 27th - Kyoto  \nMarch 28th to 31st - Osaka  \nApril 1st to April 4th - Hokkaido Region  \nApril 5th to April 8th - Tokyo\n\nI am a bit shy, but would greatly appreciate some company to go explore or to go get some food!",
                "score": 1
            },
            {
                "id": "mf49qml",
                "body": "Hi All! I am selling AT FACE VALUE (1,100 Yen ($7.33)) n=2 1-Day Unlimted Pass Kyoto Bus/Subway. I bought them and never used them! They are activated for the day that they are used on!  Let me know if you are interested. I will sell both for $10 by Venmo! I will then send them by USPS to anywhere in the US! I will put in the mail same day! [https://imgur.com/a/xXAJ66W](https://imgur.com/a/xXAJ66W)",
                "score": 1
            },
            {
                "id": "mfeex8s",
                "body": "Hi all, couple from UK, M31 and F27, we're interested mainly in culture, nature/ gardens and FOOD! Also enjoy anime and nintendo stuff.\n\nOur itinerary is:\n\n15-18 Tokyo (staying shinjuku)\n18-22 Kyoto\n22-23 Hiroshima \n23-26 Osaka\n26-27 Nara\n28-30 Tokyo (staying Ueno)",
                "score": 1
            },
            {
                "id": "mfghnw9",
                "body": "38m from Singapore. Gonna be in Tokyo from 12 to 24 of March, have been all over Japan multiple times and will be hiking the nakasendo trail from 16-20 march. Have got a few restaurants booked for most nights, would love to hang out, chill over dinner.",
                "score": 1
            },
            {
                "id": "mfgiyds",
                "body": "Hi, if anyone is interested in Ghibli museum on 3/16 at noon. I have an extra ticket since someone in my group dropped out. Ticket is 1000 yen, let me know if your interested!",
                "score": 1
            },
            {
                "id": "mfk926v",
                "body": "Hi I'm 30M traveling in Tokyo from March 1st to March 26th.\n\nWould love to explore get drinks or anything else. Feel free to DM me!",
                "score": 1
            },
            {
                "id": "mfmc9c9",
                "body": "Hi! 32F from US. Will be in Tokyo from 3/25-3/29. On 3/27 I’ll be at Disney Sea. First time in Japan.",
                "score": 1
            },
            {
                "id": "mfmqo17",
                "body": "Hey! I'm a 21F from Germany and will begin my exchange semester in Osaka starting end of March!  \nI'll be in:  \n\\- Kyoto: 3/23 - 3/25  \n\\- Osaka 3/25 - 3/31\n\nIf you also like exploring local sights, cozy neighborhoods, grabbing a coffee on the go, going shopping (anime merch is a plus :) ), having lunch or dinner together, let me know!  \nI'm fluent in German, Polish, English, French and a tiny bit of Japanese :)",
                "score": 1
            },
            {
                "id": "mfmwe4a",
                "body": "I'm a solo 26M first time traveler from Turkey, I know native level English but I know next to no Japanese. This is my first travel to both Japan and abroad, I'm hoping to meet some folks who can help me as I'm feeling anxious. I'm landing at evening of March 15.\n\nI'm in Kyoto between 16-20 and Tokyo between 20-22. I can provide full itinerary in messages so maybe we can go together if our plans align.",
                "score": 1
            },
            {
                "id": "mfouxhb",
                "body": "I'll be in the Yokosuka(I'm staying here)/Yokohama/Tokyo area until March 13th, but unavailable Mar 8-9.\n\n23m\n\nUS (also speak Mandarin, and basic Spanish)\n\nI'm not the biggest anime fan, but I'm a huge manga nerd. Some of my favorites include Ajin, Parasyte, HxH, and Kagurabachi.\n\nIn terms of travel, I'm usually down for anything I haven't done yet, I typically start my day with a loose plan and then be spontaneous.",
                "score": 1
            },
            {
                "id": "mfu6a0l",
                "body": "Hi everyone I’m 26M from Scotland! This will be my first time in Japan \n\nI’ll be in:\n\nTokyo 5th March - 8th\nKyoto 9th March - 12th\nOsaka 13th March - 16th \nTokyo 17th March - 20th \n\nLooking to go to Hiroshima, USJ, Mount Fuji, Nara and have the Sumo wrestling in Osaka booked for the 14th! Anyone wanting to meet up for some food or maybe one of the trips let me know please. Thanks!😌",
                "score": 1
            },
            {
                "id": "mfwlwjd",
                "body": "Hey! Canadian 26m here! I want to do a classic Japan-style karaoke thing but my friends aren’t much into karaoke. \n\nWould anybody be interested in renting a karaoke room together for a night? I’m in Tokyo March 4-10. \n\nKyoto March 10-14 and Osaka March 14-18",
                "score": 1
            },
            {
                "id": "mfx367b",
                "body": "Hi everyone!  I’m 30M traveling solo from Los Angeles, US. This is my 2nd time in Japan.\n\nI’m staying in \nTokyo 3/14-3/16 and 3/18\nOsaka/Kyoto 3/17-3/19\n\nGoing on a day trip to Kamakura,Kanazawa, as well as a sumo match in Osaka and soccer game in Yokohama and baseball game in Tokyo dome. Let ,e know of anyone wants to meet up and do anything really. Just looking to grab a drink or a meal and walk around and explore really!",
                "score": 1
            },
            {
                "id": "mfxaxmk",
                "body": "Hi all, I’m 27M solo traveller from Australia. Fluent in english but all I can in Japanese is ‘this beer is tasty’.\n\nI’ll be in Osaka from today until 3/7, and then Kyoto until the 11th of March. Keen to hit up some up bars / restaurants. Feel free to DM me if you wanna link up!",
                "score": 1
            },
            {
                "id": "mfz8wd4",
                "body": "I'm solo 26M traveler from Turkey. Native level in English but have next to no Japanese. I'll be in Kyoto between 16-20 and Tokyo between 20-22. Feel free to DM me for meeting.",
                "score": 1
            },
            {
                "id": "mg2lyij",
                "body": "Hello! I'm (26F) from NJ/NY looking for a fellow foodie to join me at Jambo Harambe on Sunday, March 23 at 9pm. The menu isn't prepaid but the course menu is 20,000 JPY and I've added the two person Stone-grilled yukhoe rice half for 5,500 JPY. I'm also going to be booking Tonkatsu Narikura sometime 3/24, 3/25, or 4/10 and am looking at Oniku Karyu as well.\n\nI'm also going to be solo in Osaka 4/3-4/5 if you'd like to explore together or grab a drink or meal.\nFluent in English and speak basic Spanish",
                "score": 1
            },
            {
                "id": "mg6sk8k",
                "body": "hi, im carmen! (21 F) i know this is later in the year, but i am traveling solo to japan in september (9/9-9-26) for my birthday! i would love to make friends before or while there! i speak japanese too which is helpful. if anyone is going around that time i’d love to chat or meet up :)",
                "score": 1
            },
            {
                "id": "mg7ehno",
                "body": "I'll be hopping on the LINE and possibly Discord for most of my communication, but...\n\n3rd annual trip to Japan 33M first time bringing someone along 31M we'll be there 3/22-4/5 Tokyo > Osaka > Kyoto.\n\nWe'll be meeting up with my friend(35F) and her husband as well as some Navy friends and personal friends, but I've had great success making friends in the past here - grabbing drinks in Golden Gai in groups, connecting the lone travelers, etc.\n\nExcited to meet some of you!\n\n(Also I'll add, for the women traveling alone who are new to this, definitely check out the LINE link - there's always a women-only side chat that forms and my friends tell me it made them feel a lot better having it available)",
                "score": 1
            },
            {
                "id": "mg7l6rw",
                "body": "March 16th till April 10th. Going for work and will be in Yokosuka so any places near there are great. \n\nMarch 21-23: Kyoto/Osaka area, staying in Osaka.\nMarch 28th-30th: Tokyo, staying in Shibuya.\nApril 4th-6th: not yet determined.\n\nM 32 with a friend of mine, also M 32. My second time here and his first, both from the US.\n\nWe’re into anime but also sight seeing. Anything Japan has to offer we’re down. We do want to go out (drinking, nightclubs, etc). I usually become the dad of groups cause I’m married, don’t drink a ton, and 6” weight lifter, but mostly like to make sure everyone has a good time and everyone gets home safe.",
                "score": 1
            },
            {
                "id": "mgd2tsv",
                "body": "45 AA M from US in Tokyo 3/13-3/18 looking for locals or travelers to try yakitori, ramen, udon, tempura, and beers.  Maybe karaoke if enough beers.  I also like to run (4-6 miles a day, slow pace).  no Japanese so traveling solo still kinda intimidating even tho it’s an ideal place for it. Feel free to DM, safe travels",
                "score": 1
            },
            {
                "id": "mh0rtff",
                "body": "Hi all! I'm 40M solo from Sweden. First time in Japan. Nothing planned as the tickets were bought today, but roughly speaking\n\n(3/18-3/21-22) Tokyo  \n(3/23-3/25) Osaka\n\nIf anyone wants to meet up for beers, drinks, dinner whatever feel free to DM or write here. I will try and check out a lot of natural wine bars, speak easies and great food.",
                "score": 1
            },
            {
                "id": "mh66zsf",
                "body": "Short trip and late notice being a work deal.\n\n35M from USA - only English sorry\nIn Osaka until the 15th, pretty much game for anything besides karaoke haha. Work is over so it's free time now.",
                "score": 1
            },
            {
                "id": "menu749",
                "body": "[deleted]",
                "score": 1
            },
            {
                "id": "mgqohoy",
                "body": "22F from Germany :D I'll be in Tokyo at the same time as you. Let me know if you wanna hang out. Do you know a good matcha place? It'll be my first time in Tokyo so I'm really looking forward to everything and I'm also very open for recommendations.",
                "score": 1
            },
            {
                "id": "mgy0pu8",
                "body": "Hey, 32, Aussie but a frequenter of America! I’m in Tokyo 12th March-19th \nI’m doing a day in Harajuku visiting animal cafes on Friday 14th and I have a spare ticket to the making of Harry Potter for the evening of Saturday 15th if that interests you?\nHappy to dm/swap insta for verification!",
                "score": 1
            },
            {
                "id": "mh60klh",
                "body": "34M from California. It’s my first time here but I’m winging it, would be down to hang out and just shop/eat/explore together. On a short four day trip here in Shinjuku (would love any advice/tips for Japan)",
                "score": 1
            },
            {
                "id": "mex196r",
                "body": "Also, I speak fluent french, english, and farsi!",
                "score": 1
            },
            {
                "id": "mgu8ko4",
                "body": "decided not to go to osaka and just stay in Tokyo. \nPlanning to either book a day trip to Kamakura or just diy it on march 11 or 14 (forecast says itll be sunny those days 🙏🏽) if anyone’s down 😊",
                "score": 1
            },
            {
                "id": "mgcy83b",
                "body": "I will be landing on 13th, could you let us know how saitama goes would like to visit if worth it thank you!",
                "score": 1
            },
            {
                "id": "mghudly",
                "body": "I’m a 38/f from California, USA. Speak English well and I have a free day on 3/9 and wanted to do a day trip to nikko or kamakura. Do u want to plan something?",
                "score": 1
            },
            {
                "id": "mfeed4b",
                "body": "British couple here similar age, leaving both tokyo and kyoto the day you leave! Gutted, similar interests as well :(\n\nNot sure what time you arrive in tokyo on 18th but I've seen this dragon dance event is happening at senso-ji on that day which we plan to see before we head to kyoto:\n\nhttps://tokyocheapo.com/events/golden-dragon-dance/",
                "score": 2
            },
            {
                "id": "mgqmkrc",
                "body": "Hey :D I would love one of the tickets! Do you know if it's possible to give them to another person? I always thought they were personalized? But if it works, I would be really happy to buy one from you :D",
                "score": 1
            },
            {
                "id": "mf3p8z3",
                "body": "Forgot to add... there is cricket going on.. DM me if you want to watch the game together. We'll have to find a place that shows cricket on TV - may be a sports bar \n\nMarch 1: SA-England \n\nMarch 2: NZ-India \n\nShould be exciting!!",
                "score": 1
            },
            {
                "id": "mgssf42",
                "body": "Hi man messaged you back could meet up in Kyoto tomorrow. Cheers",
                "score": 1
            },
            {
                "id": "mgss9d4",
                "body": "DM’d you mate!",
                "score": 1
            },
            {
                "id": "mgw5soz",
                "body": "Interested! DMed you.",
                "score": 2
            },
            {
                "id": "meptu90",
                "body": "You're pimping yourself out for a theme park?",
                "score": 3
            },
            {
                "id": "mh5qlxg",
                "body": "Hey, see my comment attached to this and let me know if you’d be interested in meeting up. I’m in Tokyo from tomorrow until the 19th",
                "score": 1
            },
            {
                "id": "mfgeowa",
                "body": "Aww so close! Thanks for the rec :)",
                "score": 1
            }
        ]
    },
    {
        "title": "7 Day Itinerary | Need Help",
        "id": "1j8idwo",
        "url": "https://www.reddit.com/r/JapanTravel/comments/1j8idwo/7_day_itinerary_need_help/",
        "score": 2,
        "comments": [
            {
                "id": "mh5ey2s",
                "body": "**Our FAQ is constantly being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, advice, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4), comment in our stickied weekly discussion thread, or check out /r/JapanTravelTips for quick questions. Thank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "mh66274",
                "body": "I am no pro, but 2 shinkansen trips to a similar place - why not travel to kyoto, stay overnight, go to jara then return to tokyo.",
                "score": 1
            },
            {
                "id": "mh6lanf",
                "body": "Traveling from Tokyo to Kyoto and Tokyo to Nara on the 4th and 6th days is expensive. And you can't relax. If you go to Kyoto and Nara, it's better to spend a night in Osaka. But even if you don't go to Kyoto or Nara, you can experience traditional Japanese townscapes and relax if you go to Hakone or Nikko near Tokyo.",
                "score": 1
            }
        ]
    }
]