[
    {
        "title": "r/KoreaTravel Info & Monthly Meet-up Thread – March 2025",
        "id": "1ivhtzh",
        "url": "https://www.reddit.com/r/koreatravel/comments/1ivhtzh/rkoreatravel_info_monthly_meetup_thread_march_2025/",
        "score": 6,
        "comments": [
            {
                "id": "meaqnip",
                "body": "* Join other travelers on Discord: [https://discord.gg/HfsGHkr9WT](https://discord.gg/HfsGHkr9WT) \n* See who's visiting when: [https://koreatravel.notion.site](https://koreatravel.notion.site)",
                "score": 1
            }
        ]
    },
    {
        "title": "Concerts Happening in Seoul in March",
        "id": "1izqhir",
        "url": "https://www.reddit.com/r/koreatravel/comments/1izqhir/concerts_happening_in_seoul_in_march/",
        "score": 100,
        "comments": [
            {
                "id": "mf4zxls",
                "body": "As always, looking for concerts later than March? Check out the ticket sites directly! :) My summary post will be up in the end of the previous month.  \n[Global Interpark](https://www.globalinterpark.com/en/category-list/concert)  \n[Melon Ticket Global](https://tkglobal.melon.com/main/index.htm?langCd=EN)  \n[Yes24 Ticket](http://ticket.yes24.com/Pages/English/Perf/FnPerfList.aspx?Genre=15456)  \n[Ticketlink](https://m.ticketlink.co.kr/global/en/performance/14)",
                "score": 20
            },
            {
                "id": "mf5487h",
                "body": "Thank you for the list!",
                "score": 4
            },
            {
                "id": "mf8lkg4",
                "body": "How the fuck is NIck Carter still allowed to tour with all the r@pe allegations and ties DIRECTLY to Diddy and his parties?!",
                "score": 3
            },
            {
                "id": "mfbnt72",
                "body": "Thank you so much for compiling this! I am traveling to Korea in March for vacation and had no idea about the Lee Minho fan meet! I managed to snag the second to last ticket!!",
                "score": 3
            },
            {
                "id": "mffj90m",
                "body": "Amazing work as always. Thank you!",
                "score": 3
            },
            {
                "id": "mflfqga",
                "body": "Currently in Korea. Thanks for this!",
                "score": 3
            },
            {
                "id": "mf9giqy",
                "body": "Hello! If I'm just visiting, where do I get a \"certificate of alien registration\" which is needed to claim the physical ticket from Melon Ticket?",
                "score": 1
            },
            {
                "id": "mfmbmar",
                "body": "Do you happen to know of any concerts happening in Seoul between 4/29-5/3?",
                "score": 1
            },
            {
                "id": "mf6uuqn",
                "body": "How do you recommend getting tickets for sold-out events, as a foreginer visitng Seoul?",
                "score": 1
            },
            {
                "id": "mf9gwek",
                "body": "You don’t. If you buy from melon global you use your passport as ID.",
                "score": 1
            },
            {
                "id": "mfmcbir",
                "body": "Most concerts in Korea happen during the weekend, so May 2-3 is your best bet. Check the sites I mentioned in my comment if anything is announced for those dates yet. But many concerts are only announced a month before, or even less. So not sure how much is on sale at this point.",
                "score": 2
            },
            {
                "id": "mf77n86",
                "body": "The only legitimate way is stalking the ticket websites and see if people cancel their tickets and buying those. Some fans stalk those sites for hours for the chance of tickets popping up…\n\nOtherwise ticket resale is illegal. There still is resale but it’s mostly through twitter or a website called Ticket Bay which isn’t foreigner friendly.",
                "score": 5
            },
            {
                "id": "mf81btm",
                "body": "As the other comment said, look for cancellations, and pay extra attention during the dates just before cancellation fees increase. And the day just before the concert for the cancellation deadline.",
                "score": 2
            },
            {
                "id": "mf71625",
                "body": "You can try a proxy service.",
                "score": 1
            },
            {
                "id": "mfbzems",
                "body": "Thank you! Translation might have been off as I have checked the other websites and it said passport or alien certificate",
                "score": 1
            },
            {
                "id": "mfmiocl",
                "body": "Thank you! I will check it out.",
                "score": 1
            },
            {
                "id": "mfv30zn",
                "body": "do you have any recommendation for proxy service?",
                "score": 1
            },
            {
                "id": "mfx4whg",
                "body": "I haven't used it myself but a friend recommended kstairway.music on instagram.",
                "score": 1
            },
            {
                "id": "mfxc0ih",
                "body": "Thank you!! I contacted them already. I think the owner of that instagram is a long time kpop fan - their name and face looks so familiar to me!",
                "score": 1
            }
        ]
    },
    {
        "title": "Things you must buy in Seoul to bring back to the US.",
        "id": "1j8js3k",
        "url": "https://www.reddit.com/r/koreatravel/comments/1j8js3k/things_you_must_buy_in_seoul_to_bring_back_to_the/",
        "score": 22,
        "comments": [
            {
                "id": "mh5r9nb",
                "body": "I love all he purse/ bag charms. I bought a few but wish I’d bought more as gifts",
                "score": 20
            },
            {
                "id": "mh5sauh",
                "body": "hangover cures",
                "score": 14
            },
            {
                "id": "mh5skp6",
                "body": "I regret not buying more snacks and tea. There were some small, open-air markets in Seoul where people sold various foods and crafts. I bought some squid chips, sesame candy, mixed nut brittle, fruit gummy candy, and sprouted barley tea, but I should've bought more.",
                "score": 9
            },
            {
                "id": "mh62z1l",
                "body": "I bought a ton of skin care items generic to give away. I also bought pretty bookmarks from a palace museum. I bought small\nScarves with tiny drawings of palace guards. They were done by children with autism and the money went to help them. Lastly I brought pretty linen tea towels from another museum.",
                "score": 5
            },
            {
                "id": "mh5rj07",
                "body": "Jewelry!! Even daiso $1> necklaces don’t tarnish. I’m heading back in April to load up at Nyunyu and a few other places",
                "score": 11
            },
            {
                "id": "mh5r35x",
                "body": "Double eyelid surgery",
                "score": 13
            },
            {
                "id": "mh5xq0p",
                "body": "contact lenses! extremely cheaper in korea",
                "score": 2
            },
            {
                "id": "mh64zhs",
                "body": "All the skincare, freeze dried fruit, socks, leather purses…",
                "score": 2
            },
            {
                "id": "mh6evhp",
                "body": "I brought a big bag of HBAF from duty free to bring in for my friends at work, and we all got addicted and polished off the bag in a couple of days lol. I'm going back in may and will absolutely be stocking up!! I would also look in the nike/adidas etc stores, not sure about the US but even with taxes stuff worked out cheaper in kr than it is in the UK. I also recommend checking out aland - they have really cool clothes and loads of stationary/knick knacks from korean artists!!",
                "score": 2
            },
            {
                "id": "mh638xx",
                "body": "New balance and adidas store at shinsegae mall have some Seoul edition tshirts that are pretty cool",
                "score": 2
            },
            {
                "id": "mh5vnxy",
                "body": "Rejuran",
                "score": 1
            },
            {
                "id": "mh66qep",
                "body": "Kakao friends alpaca (Ryan), you can buy one of the two and bring it as a personal item on your flight",
                "score": 1
            },
            {
                "id": "mh69u1t",
                "body": "HBAF, I'm addicted now\n\nFruit gummies are delicious\n\nSkincare obv if you're into that (my wife loves the Beauty of Joseon suncreen stick)",
                "score": 1
            },
            {
                "id": "mh6bfn1",
                "body": "Food and Maxim Coffee 😂😂😂",
                "score": 1
            },
            {
                "id": "mh6dg25",
                "body": "Just go to Artbox",
                "score": 1
            },
            {
                "id": "mh6gzhn",
                "body": "swing chip lol",
                "score": 1
            },
            {
                "id": "mh6mgww",
                "body": "Choonsik and other Kakao friends",
                "score": 1
            },
            {
                "id": "mh6mt9q",
                "body": "Glasses",
                "score": 1
            },
            {
                "id": "mh5xmvq",
                "body": "😂",
                "score": 6
            },
            {
                "id": "mh65l43",
                "body": "I heard one of the Nike’s does custom prints exclusive to Seoul",
                "score": 2
            },
            {
                "id": "mh66u1l",
                "body": "Not just prints but patches. It's a pretty cool store,it's the one in Dongdaemun",
                "score": 5
            },
            {
                "id": "mh6cegm",
                "body": "The ones in Myeongdong and Hongdae do them too. I got a cap from Hongdae and it had Hongdae specific patches.",
                "score": 2
            }
        ]
    }
]